[
  {
    "id": "1mj1olw",
    "subreddit": "Entrepreneur",
    "title": "I spent $47k and 18 months building an \"AI startup.\" Here's the brutal truth about why 90% of AI businesses are doomed.",
    "author": "Nipurn_1234",
    "created_utc": 1754478474.0,
    "score": 1403,
    "num_comments": 399,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1mj1olw/i_spent_47k_and_18_months_building_an_ai_startup/",
    "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1mj1olw/i_spent_47k_and_18_months_building_an_ai_startup/",
    "selftext": "**TL;DR:** Burned through $47k building an AI tool that 12 people use. Here's what the \"AI gold rush\" really looks like from the trenches, and why most AI startups are just expensive tech demos.\n\n# The Setup (AKA How I Got Caught Up in the Hype)\n\n18 months ago, I was a perfectly happy software consultant making decent money. Then ChatGPT happened, and suddenly everyone was an \"AI entrepreneur.\" My LinkedIn feed was nothing but:\n\n* \"I built an AI that does X in 10 minutes!\"\n* \"Our AI startup just raised $2M!\"\n* \"$10k MRR with AI tools!\"\n\nI got FOMO and thought, \"How hard can it be?\"\n\n**Spoiler alert:** Very hard.\n\n# The Idea (That Seemed Brilliant at 2 AM)\n\nI decided to build an AI-powered content creation tool for small businesses. The pitch was simple: \"Input your business details, get professional marketing copy in seconds.\"\n\nWhy this seemed genius:\n\n* Small businesses suck at copywriting\n* They don't want to hire expensive agencies\n* AI can write decent copy\n* Subscription model = recurring revenue\n\nI spent weeks validating this idea by asking friends, \"Would you pay for this?\" Everyone said yes.\n\n**First mistake:** Asking people what they'd pay for instead of asking them to actually pay for it.\n\n# The Build (18 Months of \"Almost Done\")\n\n**Months 1-3: The MVP That Wasn't Minimum** I started building what I thought was an MVP. Ended up with:\n\n* Custom AI training pipeline\n* Beautiful UI with 47 different templates\n* User authentication system\n* Payment processing\n* Admin dashboard\n* Analytics suite\n\nCost so far: $12k (mostly my own development time valued at $100/hour)\n\n**Months 4-8: Feature Creep Hell** Beta users started asking for features:\n\n* \"Can it write in different tones?\"\n* \"What about social media posts?\"\n* \"Can it integrate with WordPress?\"\n* \"What about email templates?\"\n\nI said yes to everything. Each feature took 2-3x longer than expected.\n\nCost so far: $28k\n\n**Months 9-12: The Technical Debt Tsunami** Nothing worked together properly. The codebase was a nightmare. I spent 4 months just refactoring and fixing bugs.\n\nCost so far: $39k\n\n**Months 13-18: Desperation Marketing** Launched on Product Hunt (ranked #47 for the day). Posted in Facebook groups. Cold emailed 500 small business owners. Tried Reddit ads, Google ads, LinkedIn outreach.\n\nTotal additional marketing spend: $8k Total users acquired: 73 Paying customers: 12\n\n**Final tally: $47k spent, $340 revenue.**\n\n# What I Got Wrong (Pretty Much Everything)\n\n# 1. I Built a Solution Looking for a Problem\n\nSmall businesses don't actually want AI copywriting tools. They want customers. Big difference.\n\nWhen I actually talked to my target market (should've done this first), here's what I learned:\n\n* They're too busy to learn new tools\n* They don't trust AI for their brand voice\n* They'd rather hire their neighbor's kid for $50\n\n# 2. I Competed with ChatGPT\n\nWhy would someone pay me $29/month when ChatGPT Plus is $20/month and does way more?\n\nMy value proposition was \"it's easier than ChatGPT.\"\n\nReality: It wasn't. And even if it was 10% easier, that's not worth paying 45% more.\n\n# 3. I Underestimated Sales &amp; Marketing\n\nI'm a developer. I thought \"build it and they will come\" was a real strategy.\n\nBreakdown of my 18 months:\n\n* Building: 14 months\n* Marketing/Sales: 4 months\n\nShould have been:\n\n* Building: 4 months\n* Marketing/Sales: 14 months\n\n# 4. I Ignored Unit Economics Until Too Late\n\nMy customer acquisition cost: $650 per customer ($8k marketing spend ÷ 12 customers) My average revenue per customer: $28 (most churned after 1 month)\n\nEven a business school dropout could see this math doesn't work.\n\n# 5. I Built for Myself, Not Customers\n\nI made assumptions about what small businesses wanted based on what I thought they should want.\n\nTurns out, they just want more sales. They don't care how beautiful your UI is.\n\n# The Real AI Business Landscape (It's Not Pretty)\n\nAfter networking with other \"AI entrepreneurs\" for 18 months, here's what I've observed:\n\n# Tier 1: The Actually Successful Ones (5%)\n\n* Had domain expertise BEFORE AI\n* Solved real problems for specific industries\n* Focused on B2B with enterprise budgets\n* Examples: AI for radiology, legal document review, financial compliance\n\n# Tier 2: The Lifestyle Businesses (15%)\n\n* Simple wrappers around OpenAI API\n* Serve very specific niches\n* Make $5k-20k/month\n* Examples: AI email responder for dentists, AI job description generator\n\n# Tier 3: The Strugglers (30%)\n\n* Built cool tech demos\n* Can't find paying customers\n* Burning through savings/investor money\n* This is where I lived\n\n# Tier 4: The Delusional (50%)\n\n* Think they're going to replace Google\n* Have raised money based on PowerPoint slides\n* Will be out of business within 2 years\n\n# What Actually Works in AI Business\n\nAfter talking to the successful Tier 1 and Tier 2 folks, here are the patterns:\n\n# 1. Pick Boring Industries\n\nThe sexiest AI companies get all the attention and funding. But plumbing contractors also need software, and there's way less competition.\n\n# 2. Charge Enterprise Prices\n\nIf you're saving a company 40 hours/week, charge them for 40 hours/week. Don't charge $29/month because that's what consumer apps cost.\n\n# 3. Focus on Compliance/Risk Reduction\n\nCompanies will pay stupid money to avoid getting sued or fined. AI that helps with compliance is worth 10x more than AI that \"increases productivity.\"\n\n# 4. Become the Expert First\n\nLearn an industry for 2-3 years BEFORE building AI for it. The AI part is easy. Understanding the problem is hard.\n\n# My Pivot Strategy (What I'm Doing Now)\n\nI'm not giving up on entrepreneurship, but I'm definitely giving up on AI for now.\n\n**New approach:**\n\n1. Pick an industry where I have connections (web development agencies)\n2. Identify a specific, expensive problem ($10k+ problem)\n3. Build the simplest possible solution (no AI needed)\n4. Charge properly ($500-2000/month, not $29/month)\n5. Get 10 paying customers before building anything fancy\n\n**The business:** Project management tool specifically for web dev agencies that integrates with their existing stack and automates client reporting.\n\nNo AI. No fancy features. Just solving one expensive problem really well.\n\n# Hard Truths About the AI Gold Rush\n\n# Truth 1: Most AI Startups Are Just Expensive Consultants\n\nIf your business model is \"AI does the work faster,\" you're selling labor arbitrage, not technology. That's a consulting business with extra steps.\n\n# Truth 2: OpenAI/Google Will Eat Your Lunch\n\nIf your competitive advantage is \"we fine-tuned GPT for X,\" you don't have a competitive advantage. You have a 6-month head start, max.\n\n# Truth 3: Customers Don't Care About Your Technology\n\nThey care about outcomes. \"AI-powered\" is not a benefit. \"Saves you 10 hours per week\" is a benefit.\n\n# Truth 4: The Technical Barriers Are Lower Than Ever\n\nBuilding AI products is easier than it's ever been. Which means everyone's doing it. Which means you need actual business advantages, not just technical ones.\n\n# What I Wish Someone Had Told Me\n\n1. **Start with the market, not the technology.** Find people with expensive problems first. Then figure out how to solve them.\n2. **B2B &gt; B2C for AI.** Businesses have money and understand ROI. Consumers just want free stuff.\n3. **Niche down relentlessly.** \"AI for small businesses\" is not a niche. \"AI for orthodontist appointment scheduling\" is a niche.\n4. **Test with money, not words.** Don't ask if people would pay. Ask them to pay.\n5. **Budget 3x longer than you think.** Everything in AI takes longer because the technology is still figuring itself out.\n\n# The Question Everyone's Asking\n\n\"Should I still start an AI business?\"\n\n**My answer:** Only if you have deep domain expertise in a specific industry, access to that industry's decision-makers, and a problem that costs companies $100k+ per year.\n\nIf your plan is \"build cool AI thing, figure out customers later,\" just save yourself the time and money. Buy index funds instead.\n\n# Final Thoughts\n\nI don't regret this experience. I learned more about business in 18 months than I did in 5 years of consulting. But I definitely could have learned it for a lot less than $47k.\n\nThe AI opportunity is real, but it's not what the Twitter influencers are selling you. It's not about building the next ChatGPT wrapper. It's about understanding specific industries so well that you can apply AI to solve their most expensive problems.\n\nMost of us (myself included) jumped on AI because the technology was exciting. But technology doesn't build businesses. Understanding customer problems builds businesses.\n\nThe gold rush mentality is exactly what's wrong with entrepreneurship right now. Everyone's looking for the quick win, the magic bullet, the secret hack.\n\nThere isn't one. There's just doing the boring work of understanding customers and solving their problems.\n\n"
  },
  {
    "id": "1juwefe",
    "subreddit": "SideProject",
    "title": "🚀 Built a Facebook Marketplace Listing Automation Software. Saves time &amp; Ad Money, Increases Facebook Engagements and Sales",
    "author": "Sensitive_Ocelot7964",
    "created_utc": 1744169297.0,
    "score": 8,
    "num_comments": 29,
    "url": "https://www.reddit.com/r/SideProject/comments/1juwefe/built_a_facebook_marketplace_listing_automation/",
    "permalink": "https://www.reddit.com/r/SideProject/comments/1juwefe/built_a_facebook_marketplace_listing_automation/",
    "selftext": "Let me share how I ended up building an automation tool for Facebook Marketplace Listing.\n\nBack in July 2024, I started selling random stuff around the house on Facebook Marketplace. First sale? A basketball I didn’t really use. Took good pics, wrote a nice title, posted it—and waited. Got a couple of messages. Meh.\n\nAbout a week later, Facebook said my listing had expired and needed to be renewed. While renewing, I got the option to share to groups. I picked 15 suggested groups.\n\nBoom. That same evening, 10 messages. 4 serious buyers. I was hooked.\n\nThat’s when I realized—**Facebook Marketplace + the right group strategy = 🔥**\n\nSoon I was selling more: a carpet, an old phone, a cooker. All within a week. Later, I worked with a phone company that funded Facebook Ads. While ads got tons of engagement, **actual sales came from my Marketplace + Group efforts**.\n\nBut here’s the pain point...\n\nOnce you're trying to list more than 5–10 items daily, doing this manually is draining. Especially with sharing to multiple groups. That’s why I started building **Fbyebot**.\n\n**💡 What is Fbyebot?**\n\nA simple automation tool that helps Facebook sellers post faster and smarter.\n\n# ✅ Features:\n\n* Auto-login to your FB account  \n* Auto-post listings (title, description, price, images)  \n* Batch upload products  \n* Post to multiple FB accounts  \n* Share listings to groups you're in  \n\n# 🧠 Why Use It?\n\n* Save 5–10+ hours/week  \n* Avoid human error  \n* Post more listings, faster  \n* Boost engagement + reach  \n* Increase your chances of making sales  \n\n**🎯 Who’s it for?**\n\n* Facebook resellers  \n* Dropshippers  \n* Small businesses scaling on FB  \n* Anyone tired of posting manually every day  \n\n\n\n# 🔍 Now I need your help\n\nI’ve tested it with phones and cars so far. Curious—what *else* could this tool help sell better?\n\nIf you're selling on Facebook, through Ads, Marketplace, or Groups, give **Fbyebot** a shot and let me know what you think. I’m open to feedback—what to tweak, improve, or remove.\n\n# 🧑‍💻 Devs:\n\nHappy to share the source code if you want to play around with it.\n\n# 💌 Want to try it out?\n\nShoot me a DM or email me at [yegonk247@gmail.com](mailto:yegonk247@gmail.com)  and I’ll send it over."
  },
  {
    "id": "1lkka2r",
    "subreddit": "microsaas",
    "title": "Is B2B Rocket the Stronger Sales Automation Solution?",
    "author": "colerncandy",
    "created_utc": 1750892353.0,
    "score": 2,
    "num_comments": 10,
    "url": "https://www.reddit.com/r/microsaas/comments/1lkka2r/is_b2b_rocket_the_stronger_sales_automation/",
    "permalink": "https://www.reddit.com/r/microsaas/comments/1lkka2r/is_b2b_rocket_the_stronger_sales_automation/",
    "selftext": "Currently using Reply io but looking for better automation. Researching alternatives to Reply io with more comprehensive capabilities. Anyone compared B2B Rocket's automation features?"
  },
  {
    "id": "1l9458z",
    "subreddit": "SaaS",
    "title": "We Built an AI Tool to Automate Warehouse Receiving – Struggling to Find early adapters (Need Help from Sales/Marketing Folks)",
    "author": "confusedprogrammer22",
    "created_utc": 1749675869.0,
    "score": 1,
    "num_comments": 12,
    "url": "https://www.reddit.com/r/SaaS/comments/1l9458z/we_built_an_ai_tool_to_automate_warehouse/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1l9458z/we_built_an_ai_tool_to_automate_warehouse/",
    "selftext": "Hey everyone,\n\nWe a team of 2 building an **AI-powered B2B SaaS product** in the supply chain space. Its called an **AI Receiving Agent** – the goal is simple: help warehouse teams **automate the processing of packing slips**, **match them against POs**, and **write back to ERP systems,** functionality will be further expanded iteratively.\n\nIt replaces the manual effort of keying in receiving documents (which is still surprisingly common at many warehouses) with an AI agent that reads documents (handles unstructured data), verifies against ERP data, do checks as per company's policies, makes a decision (auto-receive or human review), and completes the ERP entry.\n\n**We have built the MVP.**  \nIt’s functional, handles various PO types, supports LLM reasoning, and we can demo it live or via video.  \n**But** — we’re struggling to break into pilot projects. Finding supply chain managers or decision-makers who are willing to test it out has been really tough.\n\nWe’re looking for someone who gets B2B, especially in logistics or supply chain, and can help us:\n\n* Get in front of potential clients\n* Refine our GTM and positioning\n* Maybe even take the lead on sales/partnerships\n\nIf you're someone with a knack for **B2B sales, marketing, or early-stage growth**, or you know someone who is, we would like to discuss this.\n\nFeel free to DM me or drop a comment.  \nalso take a look at the demo video we made demonstrating MVP version of the product.  \n\nhttps://youtu.be/dAAJjpdSuSU?si=TUWTBb9J1LXID_ie\n\nThankyou guys."
  },
  {
    "id": "1lvzm10",
    "subreddit": "productivity",
    "title": "How to automate sales emails directly from Gmail or HubSpot?",
    "author": "tiktakt0w",
    "created_utc": 1752109124.0,
    "score": 2,
    "num_comments": 7,
    "url": "https://www.reddit.com/r/productivity/comments/1lvzm10/how_to_automate_sales_emails_directly_from_gmail/",
    "permalink": "https://www.reddit.com/r/productivity/comments/1lvzm10/how_to_automate_sales_emails_directly_from_gmail/",
    "selftext": "Trying to streamline my outreach without adding another huge platform to the mix. Ideally want something that works right from Gmail or integrates with HubSpot, so I don’t have to jump between a bunch of tools.  \nLooking to automate sequences and follow-ups but still keep it feeling personal."
  },
  {
    "id": "1mi0y03",
    "subreddit": "SaaS",
    "title": "Where does sales automation end and human-led selling begin?",
    "author": "tine_petric",
    "created_utc": 1754372406.0,
    "score": 2,
    "num_comments": 3,
    "url": "https://www.reddit.com/r/SaaS/comments/1mi0y03/where_does_sales_automation_end_and_humanled/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1mi0y03/where_does_sales_automation_end_and_humanled/",
    "selftext": "With all the tooling (outreach, sequencing, AI replies), it’s easy to automate too much.\nHow do you draw the line between efficiency and real connection, especially for B2B SaaS?"
  },
  {
    "id": "1mfymfv",
    "subreddit": "Business_Ideas",
    "title": "Automating sales operations using AI during and post calls",
    "author": "vibhinna_",
    "created_utc": 1754161838.0,
    "score": 4,
    "num_comments": 1,
    "url": "https://www.reddit.com/r/Business_Ideas/comments/1mfymfv/automating_sales_operations_using_ai_during_and/",
    "permalink": "https://www.reddit.com/r/Business_Ideas/comments/1mfymfv/automating_sales_operations_using_ai_during_and/",
    "selftext": "I have worked across B2B sales during my career and as a sales personnel there was lot of admin task like preparing for sales calls, effectively sell during the call and then enter data to CRM, send emails or messages and set up calls etc.\n\nThis is the exact problem I am trying to solve with a friend and are inching towards MVP.\n\nI want to hear from the community what would be more value add to users\n\n1. Have an effective sales copilot helping you during the call\n2. Completely automate post call ops like setting up meeting, creation of tasks etc\n3. Is there anything else?\n\nThis will really help me prioritize by taking in inputs from this community\n\n  \nPS: If anyone is looking to work on similar problem statement, happy to work together"
  },
  {
    "id": "1lhgni4",
    "subreddit": "Entrepreneur",
    "title": "How AI automation helped a realtor double his sales. What challenges do you face with automation?",
    "author": "leothewolf122",
    "created_utc": 1750571425.0,
    "score": 0,
    "num_comments": 7,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1lhgni4/how_ai_automation_helped_a_realtor_double_his/",
    "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1lhgni4/how_ai_automation_helped_a_realtor_double_his/",
    "selftext": "I have been thinking about how AI and automation can save time in small businesses. For example, a realtor I know automated how he shortlisted homes for clients which freed up hours every week and helped him focus more on closing deals. His sales doubled as a result.\n\nWhat kind of repetitive or time-consuming tasks do you face in your business? Have you tried any AI or automation tools? I am curious to hear what works or doesn’t work for others."
  },
  {
    "id": "1kte93b",
    "subreddit": "SaaS",
    "title": "I built an AI Sales Agent to automate cold outreach — it’s booking meetings while I sleep",
    "author": "FlatLiterature9702",
    "created_utc": 1747988101.0,
    "score": 1,
    "num_comments": 10,
    "url": "https://www.reddit.com/r/SaaS/comments/1kte93b/i_built_an_ai_sales_agent_to_automate_cold/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1kte93b/i_built_an_ai_sales_agent_to_automate_cold/",
    "selftext": "As a solo founder, I was spending hours every week:  \n• Finding leads  \n• Writing cold emails  \n• Following up manually (when I remembered)\n\nSo I built something to replace all of that.\n\nIt’s called **ElevateSells**, and it acts like a full-time sales assistant — powered by AI.\n\nHere’s what it does:\n\n✅ Finds leads based on your target market  \n✅ Writes **personalized cold emails** (no templates, no {first\\_name} laziness)  \n✅ Sends them at the right time  \n✅ Follows up automatically, 100% hands-off  \n✅ Tracks replies and meetings — and learns what works\n\nThe whole thing feels like having an SDR who never sleeps, never forgets to follow up, and actually sounds human.\n\nMy goal wasn’t to build yet another “sales tool” — it was to *replace the part of the founder job I dreaded most* with something that just worked.\n\nRight now it’s running live on my own outreach — and booking real meetings.\n\nIf you’re running a B2B startup and don’t want to waste time on manual prospecting, I’d be happy to show you how I set it up.\n\nFeedback, questions, or critiques are welcome 🙌"
  },
  {
    "id": "1m205m3",
    "subreddit": "SaaS",
    "title": "Feedback On Tool to Automate Finding KDMs on LI Sales Navigator",
    "author": "Expensive-Carrot-205",
    "created_utc": 1752733376.0,
    "score": 1,
    "num_comments": 1,
    "url": "https://www.reddit.com/r/SaaS/comments/1m205m3/feedback_on_tool_to_automate_finding_kdms_on_li/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1m205m3/feedback_on_tool_to_automate_finding_kdms_on_li/",
    "selftext": "Hey all!\n\nI’m building an MVPs Chrome Browser extension that uses AI to take control of your LI Sales Navigator and automate the process of finding KDMs for accounts. Specifically, it automates these two tasks:\n1) Scanning through roles at a company to find the most relevant titles to your persona \n2) Diving through those profiles to verify things like location, responsibilities, titles of connections, skills, and interests.\n\nThe model has been trained on an extensive set of personas, but it learns from industry knowledge you input, and it constantly learns from incorrect recommendations.\n\nIf anyone here burns time prospecting for KDMs on LI Sales Navigator, and that’s frustrating, getting in the way of hitting SQLs / SOLs, or error-prone, I’d love to hear your feedback, criticisms, and thoughts on this idea\n\nThis is most relevant for sales teams prospecting medium to large accounts with relatively consistent ICPs and relatively consistent personas "
  },
  {
    "id": "1m3ve40",
    "subreddit": "SaaS",
    "title": "Built Salesdok.com to automate your pre-sales Q&amp;A - Feedbacks are welcomed !",
    "author": "ExtensionOriginal960",
    "created_utc": 1752929186.0,
    "score": 1,
    "num_comments": 0,
    "url": "https://www.reddit.com/r/SaaS/comments/1m3ve40/built_salesdokcom_to_automate_your_presales_qa/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1m3ve40/built_salesdokcom_to_automate_your_presales_qa/",
    "selftext": "Hey r/SaaS 👋\n\nI'm working on a SaaS tool called [**Salesdok**](https://salesdok.com/) – it’s an AI Assistant that helps SaaS founders like us handle  **pre-sales questions** using your own content (website, docs, FAQs, etc.).\n\n# 🧠 What it does:\n\n* Uses **RAG (Retrieval-Augmented Generation)** to understand and answer user questions\n* Trained on your content: web pages, PDFs, product docs, pricing pages, etc.\n* Embedded on your site with one line of code\n* Ideal for answering things like:\n   * “Do you support X?”\n   * “How is this different from \\[competitor\\]?”\n   * “What’s your refund policy?”\n   * “Is this available for teams?”\n\n# 🧪 Why I built it:\n\nI noticed that founders and indie SaaS builders often waste time replying to the same pre-sales DMs and emails over and over. An AI  trained on your actual product info can free up your time while keeping leads warm.\n\n# ✅ Live Now — Free plan available:\n\nYou can try it right now. There’s a  **free plan** to test it with unlimited knowledge base and 150 chunks of data limit. No credit card required.\n\n👉 [Check it out here](https://salesdok.com/)  \nI’d *love* your feedback — even if it’s brutally honest."
  },
  {
    "id": "1kvf5ef",
    "subreddit": "smallbusiness",
    "title": "Best budget Friendly Marketing and Sales Automation CRM",
    "author": "Cool_Engineering_771",
    "created_utc": 1748212920.0,
    "score": 2,
    "num_comments": 5,
    "url": "https://www.reddit.com/r/smallbusiness/comments/1kvf5ef/best_budget_friendly_marketing_and_sales/",
    "permalink": "https://www.reddit.com/r/smallbusiness/comments/1kvf5ef/best_budget_friendly_marketing_and_sales/",
    "selftext": "\nHi Everyone,\n\nI'm having a Ecommerce business and i'm looking for a best budget friendly automation CRM for my Small business.\n\nNote - I want to automate emails, whatsapp messages , leads from all sources, Social schedule and etc.\n\nAny suggestions?\n\nThanks in advance \n\nBest \nDivy"
  },
  {
    "id": "1lluyox",
    "subreddit": "SaaS",
    "title": "Looking for a Sales &amp; Business Partner to Launch AI Automation productized SaaS  for Shopify",
    "author": "JobRoz",
    "created_utc": 1751033662.0,
    "score": 1,
    "num_comments": 1,
    "url": "https://www.reddit.com/r/SaaS/comments/1lluyox/looking_for_a_sales_business_partner_to_launch_ai/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1lluyox/looking_for_a_sales_business_partner_to_launch_ai/",
    "selftext": "I have around 15 years of product and technology experience. \n\nI am looking to build a productized SaaS agency that provides e-commerce solutions so that e-commerce store can increase their revenue and customer satisfaction.\n\nI will do this by building n8n workflow automation across their entire set of system and tools and creating a Revops dashboard for tracking.\n\n\nI am looking for someone from UK or USA who has done some business development in past for e-commerce and together we can build something really nice for e-commerce store to help them 5x their cost spent on us.\n\nI am thinking of 3 monthly plans like $500 for basic ai Automation, $2500 for advanced automation and then custom pricing plan.\n\nWe would reach to only Shopify store above $300k annual revenue.\n\n "
  },
  {
    "id": "1le8h0p",
    "subreddit": "indiehackers",
    "title": "Need a sales guy to sell n8n automations",
    "author": "Cute_Combination694",
    "created_utc": 1750222113.0,
    "score": 1,
    "num_comments": 2,
    "url": "https://www.reddit.com/r/indiehackers/comments/1le8h0p/need_a_sales_guy_to_sell_n8n_automations/",
    "permalink": "https://www.reddit.com/r/indiehackers/comments/1le8h0p/need_a_sales_guy_to_sell_n8n_automations/",
    "selftext": "Hey we build automations for businesses.\nI am looking for a sales guy to work for 10-12% cut, dm if interested.."
  },
  {
    "id": "1ko98zb",
    "subreddit": "SaaS",
    "title": "What are you using as an enterprise sales team to automate research?",
    "author": "ShoddyPut8089",
    "created_utc": 1747422900.0,
    "score": 2,
    "num_comments": 5,
    "url": "https://www.reddit.com/r/SaaS/comments/1ko98zb/what_are_you_using_as_an_enterprise_sales_team_to/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1ko98zb/what_are_you_using_as_an_enterprise_sales_team_to/",
    "selftext": "We’re looking to become more efficient as a sales team and don’t really believe in AI generated messages. But AI to help us with prospecting would be a huge time saver. \n\n\n\nSo we’re currently looking for tools that can search the web for information on a particular person, their company and provide insights that would help us frame better cold outbound campaigns suited to their current pain points. \n\n\n\nIf you’ve built internal tools as a sales team, would love to hear how you guys did it. \n\n\n\nThanks in advance!"
  }
]