[
  {
    "id": "1l2j5tn",
    "subreddit": "SaaS",
    "title": "i want to automate my customer support - need voice AI help",
    "author": "Delicious_Track6230",
    "created_utc": 1748974438.0,
    "score": 2,
    "num_comments": 1,
    "url": "https://www.reddit.com/r/SaaS/comments/1l2j5tn/i_want_to_automate_my_customer_support_need_voice/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1l2j5tn/i_want_to_automate_my_customer_support_need_voice/",
    "selftext": "\nRunning a small e-commerce store and getting 90+ support calls daily. Can't afford to hire more people, but customers are now leaving i'm not able to handle this and searching for ai voice solutions.\n\n I just need something that sounds natural and can handle my load related to order status, returns, shipping info without hanging up on customers.\n\nany advice? really can't afford to mess this up and lose even more customers.\n"
  },
  {
    "id": "1i3igo9",
    "subreddit": "SaaS",
    "title": "Is automated customer support worth the investment for apps?",
    "author": "kateomali",
    "created_utc": 1737126649.0,
    "score": 3,
    "num_comments": 8,
    "url": "https://www.reddit.com/r/SaaS/comments/1i3igo9/is_automated_customer_support_worth_the/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1i3igo9/is_automated_customer_support_worth_the/",
    "selftext": "Handling customer support manually has been manageable so far, but as my app grows, it’s becoming a bottleneck. I’m considering automating part of the process with chatbots or pre-written FAQs.\n\nFor those who’ve implemented automated support, did it improve efficiency without losing the personal touch? And how do you decide what’s worth automating?"
  },
  {
    "id": "1k3xzoc",
    "subreddit": "SideProject",
    "title": "Faceless YouTube channel? I automated the whole thing. 130K views so far.",
    "author": "peppo-online",
    "created_utc": 1745187308.0,
    "score": 359,
    "num_comments": 233,
    "url": "https://www.reddit.com/r/SideProject/comments/1k3xzoc/faceless_youtube_channel_i_automated_the_whole/",
    "permalink": "https://www.reddit.com/r/SideProject/comments/1k3xzoc/faceless_youtube_channel_i_automated_the_whole/",
    "selftext": "**🆕 \\*\\*Edit (April 21):\\*\\***  \nThis started as a weekend experiment – now it’s generating 100K+ views across YouTube and TikTok.\n\n**The full system is now available on Gumroad — including all workflows, prompt templates, and database structures.**\n\n**✅ \\[Starter Edition\\](https://short.bons-ai.de/starter)**  \n**✅ \\[Pro Suite\\](https://short.bons-ai.de/pro)**  \n**✅ \\[Ultimate\\](https://short.bons-ai.de/ultimate)**\n\n\n\nhttps://preview.redd.it/je99b2c8rkve1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=a3b1a55674ad431e96c84acdaf399809f2b5f481\n\n  \nThis started as a weekend experiment – now it’s generating 100K+ views across YouTube and TikTok.\n\nI started with **zero followers, zero views, zero knowledge**.  \nNow, after \\~3 weeks of posting **automated YouTube Shorts and TikToks**, I’ve passed **130,000 views**, and growth is steady – both in views and subscribers.\n\nEverything is powered by **n8n, JSON2VIDEO, Baserow, and a few other tools** I stitched together.  \nI’ll keep evolving this system (I’m currently working on affiliate funnels + monetization) — but here’s the current stack if you’re curious:\n\n# 🧠 1. Main Orchestrator Workflow\n\n* Central controller for all automations\n* Switches categories dynamically\n* Triggers the right LLM logic &amp; templates\n* Dispatches to different social media upload flows\n\n# 📤 2. Upload Workflow\n\n* Updates the Baserow DB\n* Uploads to Google Drive\n* Posts to YouTube (+ automatic playlisting)\n* Uploads to TikTok &amp; Instagram via [upload-post.com](https://upload-post.com/)\n* Easily extendable to other platforms\n\n# 🎬 3. Intro / Scene / Metadata Generator\n\n* Includes a Supervisor LLM layer + Postfilter → cleans up unsafe or overly long prompt output\n* Uses a master system prompt with dynamic Baserow variables for style, voice, tone, etc.\n* Scene count, duration, and content type all configurable per category\n\n# 💡 4. Automated Idea Generation\n\n* Scrapes trending content from niche sources\n* Picks random categories\n* Generates 10 raw ideas, then filters the top 5\n* Final idea JSON is stored in Baserow, ready for production\n\n# 📊 5. YouTube Metrics Collector\n\n* Pulls views, likes, copyright strikes, comment stats etc.\n* Ready for visualizations or trend detection\n\n# 🐿 6. Special: Reddit Video Scraper\n\n* Targets specific subreddits\n* Downloads, trims &amp; stores clips in local S3 (MiniO)\n* Uses yt-dlp + custom tools to generalize &amp; merge footage\n* Creates compilations from similar clips via metadata matching\n\n# 💬 7. YouTube Auto-Reply Bot\n\n* Triggered by email\n* Analyzes new comments, stores to DB, and replies automatically\n\n# 💸 8. Affiliate Promo System\n\n* Dynamically injects call-to-actions into descriptions &amp; comments\n* Supports rotating campaigns &amp; evergreen default content\n* All managed via Baserow\n\n# 🧷 9. Auto-Affiliate Comment Drop\n\n* First comment on every video is automatically posted\n* Uses clean formatting &amp; emoji-based bulletpoints\n\n# 📱 10. Shortform &amp; Longform Video Support\n\n* Two separate JSON2VIDEO templates (9:16 and 16:9)\n* Dynamically controlled scene count\n* Great for cinematic Shorts or long-form storytelling videos\n\nEverything is **100% automated** — once a video idea lands in Baserow, the rest is handled by the system.  \nI’m still improving and experimenting (and soon launching this as a product on Gumroad).\n\nAtm. I'll spend like 60 cents per shorts video!\n\nIf you’re building anything similar or want to chat about video automation / monetization, happy to connect!  \nLet me know if you'd like to get notified when the full version launches.\n\nExamples:  \n[https://www.youtube.com/watch?v=RyhsCeU\\_AsY](https://www.youtube.com/watch?v=RyhsCeU_AsY)  \n[https://www.youtube.com/shorts/IWUdHIOyYyA](https://www.youtube.com/shorts/IWUdHIOyYyA)\n\n💡 Feedback, suggestions, or questions welcome!"
  },
  {
    "id": "1gne19s",
    "subreddit": "SaaS",
    "title": "List down Common problem of customer support and sales which can be automated",
    "author": "iamma_00",
    "created_utc": 1731170282.0,
    "score": 1,
    "num_comments": 4,
    "url": "https://www.reddit.com/r/SaaS/comments/1gne19s/list_down_common_problem_of_customer_support_and/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1gne19s/list_down_common_problem_of_customer_support_and/",
    "selftext": "1)Frequently Asked Questions (FAQs)\n\n2)Order Processing and Tracking\n\n3)Customer Feedback Collection\n\n4)Lead Qualification\n\n5)Appointment Scheduling\n\n6)Customer Onboarding\n\n7)Follow-Up Communications\n\n8)Inventory Management\n\n9)Customer Support Ticketing\n\n10)Reporting and Analytics"
  },
  {
    "id": "1h4paiv",
    "subreddit": "SideProject",
    "title": "Streamline Your Customer Support with Auralis AI: The Future of AI-Powered Automation",
    "author": "Muted_Top_591",
    "created_utc": 1733123058.0,
    "score": 1,
    "num_comments": 0,
    "url": "https://www.reddit.com/r/SideProject/comments/1h4paiv/streamline_your_customer_support_with_auralis_ai/",
    "permalink": "https://www.reddit.com/r/SideProject/comments/1h4paiv/streamline_your_customer_support_with_auralis_ai/",
    "selftext": "Hi everyone,  \nI’d love to share a project I’ve been working on—Auralis AI, a powerful AI platform that automates customer support. It helps businesses streamline workflows, reduce human error by 30%, and provide 24/7 multilingual support for better customer engagement.\n\nTo give you a better idea of how it works, I’ve put together a demo video that walks through the key features and benefits of Auralis AI. Whether you’re looking to improve your customer service or integrate AI into your existing systems, this might be the solution you need.\n\nCheck out the demo video here:  \n[https://youtu.be/DHiD7Esebuo](https://youtu.be/DHiD7Esebuo)  \nAnd for more information, visit our website:  \n[Auralis AI - Customized AI for CX Teams](https://auralis.ai/)\n\nFeel free to ask any questions or share your thoughts! I'd love to hear your feedback."
  },
  {
    "id": "1exqoax",
    "subreddit": "SaaS",
    "title": "Are you investing enough in customer support, or are you relying too heavily on automation?",
    "author": "raunakhajela",
    "created_utc": 1724249597.0,
    "score": 0,
    "num_comments": 6,
    "url": "https://www.reddit.com/r/SaaS/comments/1exqoax/are_you_investing_enough_in_customer_support_or/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1exqoax/are_you_investing_enough_in_customer_support_or/",
    "selftext": ""
  },
  {
    "id": "1g4sd97",
    "subreddit": "SideProject",
    "title": "I made an AI-powered first line customer support automation tool",
    "author": "Narrotapp",
    "created_utc": 1729057514.0,
    "score": 0,
    "num_comments": 2,
    "url": "https://www.narrot.org",
    "permalink": "https://www.reddit.com/r/SideProject/comments/1g4sd97/i_made_an_aipowered_first_line_customer_support/",
    "selftext": ""
  },
  {
    "id": "1g3gc3l",
    "subreddit": "SaaS",
    "title": "Customer Support Platform with Chat Workflow for Initial Chat Automation",
    "author": "Prudent-Turnip5373",
    "created_utc": 1728914102.0,
    "score": 1,
    "num_comments": 0,
    "url": "https://www.reddit.com/r/SaaS/comments/1g3gc3l/customer_support_platform_with_chat_workflow_for/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1g3gc3l/customer_support_platform_with_chat_workflow_for/",
    "selftext": "Hello Everyone,\n\nI'm developing a Customer Support Platform with Chat, Tickets, Mailboxes, a Knowledge Base, and other required features for CSP. I know there are many tools available, such as Intercom, HelpScout, FreshWorks, and others, but I feel I can develop one that focuses on Chat and Ticket Automation/Workflow.\n\nNot all startups/businesses can afford a 24-hour support team, so an Automated Chat Workflow can help resolve queries even in off-hours. Besides that, this can reduce the number of Tickets and Live Chat requests, ultimately reducing the number of support agents, and Ticket Automation can also reduce support agents' work. So, my main focus is on Chat Workflow and Ticket Workflow.\n\nPlease let me know if this is helpful for businesses with support teams or if there are already tools available that have Chat Workflow.\n\nYou can also suggest things that the existing tools are missing and are helpful for Support Agents and Businesses.\n\nI'm also looking for people who have support teams or are support agents or leaders, to discuss if a new feature is helpful or not.\n\nThanks :)"
  },
  {
    "id": "1jn7rau",
    "subreddit": "SaaS",
    "title": "After 20 Failures, I Finally Built A SaaS That Makes Money 😭 (Lessons + Playbook)",
    "author": "FI_investor",
    "created_utc": 1743321970.0,
    "score": 431,
    "num_comments": 120,
    "url": "https://www.reddit.com/r/SaaS/comments/1jn7rau/after_20_failures_i_finally_built_a_saas_that/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1jn7rau/after_20_failures_i_finally_built_a_saas_that/",
    "selftext": "Years of hard work, struggle and pain. 20 failed projects 😭\n\nBuilt it in a few days using Ruby on Rails, PostgreSQL, Digital Ocean, OpenAI, Kamal, etc...\n\nLessons:\n\n* Solve real problems (e.g, save them time and effort, make them more money). Focus on the pain points of your target customers. Solve 1 problem and do it really well.\n* Prefer to use the tools that you already know. Don’t spend too much time thinking about what are the best tool to use. The best tool for you is the one you already know. Your customers won't care about the tools you used, what they care about is you're solving the problem that they have.\n* Start with the MVP. Don't get caught up in adding every feature you can think of. Start with a Minimum Viable Product (MVP) that solves the core problem, then iterate based on user feedback.\n* Know your customer. Deeply understand who your customer is and what they need. Tailor your messaging, product features, and support to meet those needs specifically.\n* Fail fast. Validate immediately to see if people will pay for it then move on if not. Don't over-engineer. It doesn't need to be scalable initially.\n* Be ready to pivot. If your initial idea isn't working, don't be afraid to pivot. Sometimes the market needs something different than what you originally envisioned.\n* Data-driven decisions. Use data to guide your decisions. Whether it's user behavior, market trends, or feedback, rely on data to inform your next steps.\n* Iterate quickly. Speed is your friend. The faster you can iterate on feedback and improve your product, the better you can stay ahead of the competition.\n* Do lots of marketing. This is a must! Build it and they will come rarely succeeds.\n* Keep on shipping 🚀 Many small bets instead of 1 big bet.\n\n**Playbook that what worked for me (will most likely work for you too)**\n\nThe great thing about this playbook is it will work even if you don't have an audience (e.g, close to 0 followers, no newsletter subscribers etc...).\n\n**1. Problem**\n\nCan be any of these:\n\n* Scratch your own itch.\n* Find problems worth solving. Read negative reviews + hang out on X, Reddit and Facebook groups.\n\n**2. MVP**\n\nSet an appetite (e.g, 1 day or 1 week to build your MVP).\n\nThis will force you to only build the core and really necessary features. Focus on things that will really benefit your users.\n\n**3. Validation**\n\n* Share your MVP on X, Reddit and Facebook groups.\n* Reply on posts complaining about your competitors, asking alternatives or recommendations.\n* Reply on posts where the author is encountering a problem that your product directly solves.\n* Do cold and warm DMs.\n\nOne of the best validation is when users pay for your MVP.\n\nWhen your product is free, when users subscribe using their email addresses and/or they keep on coming back to use it.\n\n**4. SEO**\n\nROI will take a while and this requires a lot of time and effort but this is still one of the most sustainable source of customers. 2 out of 3 of my projects are already benefiting from SEO. I'll start to do SEO on my latest project too.\n\nThat's it! Simple but not easy since it still requires a lot of effort but that's the reality when building a startup especially when you have no audience yet.\n\nLeave a comment if you have a question, I'll be happy to answer it.\n\nP.S. The SaaS that I built is a [tool that automates finding customers](https://customerfinderbot.com/) from social media. Basically saves companies time and effort since it works 24/7 for them. Built it to scratch my own itch and surprisingly companies started paying for it when I launched the MVP and it now grew to hundreds of customers from different countries, most are startups."
  },
  {
    "id": "1fap8jq",
    "subreddit": "SaaS",
    "title": "Do NOT use Stripe. They will ruin your business.",
    "author": "lead-indicator",
    "created_utc": 1725654734.0,
    "score": 329,
    "num_comments": 255,
    "url": "https://www.reddit.com/r/SaaS/comments/1fap8jq/do_not_use_stripe_they_will_ruin_your_business/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1fap8jq/do_not_use_stripe_they_will_ruin_your_business/",
    "selftext": "I am leaving this message here because they removed it from r/stripe. If you are currently using Stripe or plan on using Stripe, I strongly encourage you to consider an alternate option as they will shut down your account for no legitimate reason and hold your funds indefinitely.\n\nI currently have over $25k in Stripe and they have closed my account, paused payouts, and they have literally gone as far as telling me they are keeping the money. I even had a payout due on August 20th for $9.5k, which was the day they closed my account. They paid it out into my business account, and then withdrew it back out of my account after it was paid! \n\nHere is exactly what happened..\n\nI run a lead generation company that does SEO, paid ads, etc for home service businesses. We have been with Stripe for over 2 years now. We just started incorporating conversational ai into our package so we can use “speed-to-lead” booking bots and reactivation campaigns. The AI stuff has been going great - so much that it’s become my main focus over the past 6 months. \n\nJust last month, a buddy of mine who runs a course/program that teaches students how to do SEO for home service businesses approached me about the idea of creating a separate course regarding conversational AI and teaching students how to set that up. We decide to go 50:50 on the course - he will endorse the course to his students and I will teach it. We create a separate Stripe account so that each of us can have full access to it and have visibility on the course sales. \n\nAfter just 3 days of launching the course, Stripe shuts down our account because they said, “After conducting a routine review of your business, we’ve found that it presents a higher level or risk than we can currently support”.I have provided them ALL of the information. All my LLC information, the websites, everything. Every student that joined signed an agreement. Not a single chargeback. \n\nStripe won’t give me the time of day. Nothing but automated emails. I ask to speak with someone on the phone. They refuse. Here is the automated email.\n\n# They say, “Based on the information available to us, including documents submitted via your dashboard appeal your decision, we’ve determined that your account still presents an unacceptable level of risk. As a result, any funds in your account balance, and any pending charges, will be reversed within 5 days of the account closure data. If a balance still remains in your account after all reversales have been processed, it will not be made available to you, in accordance with Section 5.6 of Service Terms for Stripe Payment..”\n\n\n\nWTF?! The balance will not be made available to me? Here is the thing, they only refunded 2 of the students. There is still $5k sitting in that account that they are just keeping! Stripe won’t even acknowledge me. They just send automated emails, refuse to pay me out, and keep the account shut down while they keep the money. \n\nHere is the part where it gets worse, and where I feel extra stupid. We had just launched the course and promoted it. So we had a calendar full of booked appointments with students who were interested in the course but no way to accept the payments. I had the bright idea of “Why don’t we just use my primary Stripe account until we get this whole thing sorted out”. So we started accepting payments in my primary Stripe account - the one that I use for my main lead gen customers.  After just a few days, Stripe shut that down too. And now they are holding over $20k in that account because it’s “high-risk”. Let me remind you that I did not have a single chargeback. \n\nThere is absolutely **NO WAY FORWARD WITH THEM**. I have explained everything to them. Provided every document. All I get is automated responses that say, “Thank you for bringing your concerns to our attention. Stripe determined that your account was too high risk to support. As such, it closed your account.”\n\nThey will NOT talk to you. They will not work with you at all. As far as I can tell, they are keen on keeping my funds in there forever unless I take legal action."
  },
  {
    "id": "1m6h008",
    "subreddit": "SaaS",
    "title": "I made a lot of mistakes with my first SaaS startup. I'm sharing them here along with the solutions I have in mind – are they correct?",
    "author": "MonkDi",
    "created_utc": 1753197771.0,
    "score": 344,
    "num_comments": 74,
    "url": "https://www.reddit.com/r/SaaS/comments/1m6h008/i_made_a_lot_of_mistakes_with_my_first_saas/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1m6h008/i_made_a_lot_of_mistakes_with_my_first_saas/",
    "selftext": "This is a longer post, but I believe in sharing experiences transparently. My first startup gave me grey hairs at 31, but I don’t regret the journey. Here I list the mistakes I made and possible solutions. Maybe it will help someone to avoid them, and I also'd be grateful if someone with more experience could tell me if the solutions I target are the right direction.\n\nA year and a half ago, my partner Val and I launched [Aiter.io](http://Aiter.io), an AI MarTech startup. The premise was simple: generate ads, content, and strategy with a single click. We followed the classic MVP playbook, building and launching in just two weeks. It was functionally basic and, frankly, looked terrible. But it worked. We got our first positive feedback and early traction, so we decided to push forward. That’s where my long journey of pain, joy, and crucial lessons began.\n\n# Mistake #1: We didn't implement signup and payments from Day 0 and lost out on 50,000 potential users.\n\nAdding a simple email signup and basic Stripe integration is only 2-3 days of development. Yet we didn't do it, deciding our \"lean\" approach meant testing only the core hypothesis. This was a critical error in judgement.\n\nA French TikToker found our product and posted a review without our knowledge. It generated 700k views overnight, driving 50,000 people to our site. Because our product was free with no signup, we lost the massive opportunity to even collect their email addresses, let alone monetise. We added the functionality later, but a viral traffic spike like that has never happened again.\n\n**Conclusion #1:** I shouldn't have been \"too lean.\" From now on, I will always integrate basic user registration and a monetisation option into your MVP from day one. It doesn't just prepare for surprise traffic; it provides much clearer data on whether users find my product valuable enough to exchange an email or money for it.\n\n# Mistake #2: I resigned from my full-time job too early. It’s better to keep your side project a side one until you hit at least ~$5,000 in MRR.\n\nAfter securing our first stable revenue (around 300 − 300− 500 a month), I was convinced that scaling would be straightforward. With 10 years in marketing, I thought I just needed to invest X to get Y. So, I switched to full-time startup mode. Gosh, that was a huge mistake. I only had savings for three months, and growing a SaaS business wasn't as linear as I’d imagined. When the savings ran out, I had to start juggling multiple freelance jobs to pay the bills, which ended up consuming even more time than my original full-time role.\n\n**Conclusion #2:** Quitting my job when I did was a massive miscalculation. My new rule for myself is to not go all-in on a startup until its MRR can comfortably cover my salary. Living in London, I've set that personal benchmark at a minimum of $5,000 MRR.\n\n# Mistake #3: I only had three months' worth of savings. It's better to have six, but the safest option is twelve. This is your startup runway.\n\nWhen my savings ran out, I fell into a vicious cycle: freelancing for survival, and working on the startup with what little energy was left. Consequently, our MRR growth was incredibly slow (we're currently at \\~$1,000-1,500), and we had no funds to reinvest. This meant we moved slower than the market and began to lose our competitive advantage. We’ve since corrected this by bringing on another great team member, but a longer financial runway would have enabled much faster scaling.\n\n**Conclusion #3:** I was completely unprepared for how long it would take to grow. Before I go \"full-time founder\" again, I will make sure I have a proper financial safety net, aiming for at least six months of living expenses in savings, with a year's worth being the ideal goal.\n\n# Mistake #4: We didn't set up product analytics (like Amplitude, GA4, and Clarity) from Day 0\n\nAnother of our \"too lean\" mistakes was neglecting to implement product analytics from launch. Because of this, we had no clear data on which features our users loved the most, which directly led to Mistake #5.\n\n**Conclusion #4:** Neglecting analytics was a \"too lean\" mistake I won't repeat. From now on, I'll set up my product analytics before I launch. It's a day of work that gives invaluable insights. For my future projects, I'll be using Amplitude for its flexibility, but at a minimum, I’d ensure basic GA4 event tracking and Microsoft Clarity are running.\n\n# Mistake #5: We went too broad with features instead of focusing on one core area and making it awesome.\n\nInitially, we only generated ad copy. I wish we’d stuck to that and perfected our product solely for the PPC market. Instead, I fell into the classic trap of building a product \"for myself.\" As a full-stack marketer, we added features for SMM, AI blogging, email generation, and strategy. This feature creep created a host of problems: complex onboarding, competing with much larger players, and a maintenance nightmare.\n\n**Conclusion #5:** I was wrong to go so broad instead of deep. My focus now is to serve a niche market segment with core features and be the best solution for that small group, rather than an average one for a broad audience. This is the path I believe leads to true product-market fit.\n\n# Mistake #6: We went too broad with our marketing, too. It would have been better to focus on mastering just 1-2 channels.\n\nWe wanted to discover what worked best, so we tried everything: Directories, Google Ads, Meta Ads, Reddit, YouTube, LinkedIn, SEO, and email. As a result, we achieved a little bit everywhere and mastered nothing. In hindsight, I should have stuck to 1-2 primary acquisition channels and 1-2 supporting ones.\n\n**Conclusion #6:** I learned that trying to do everything in marketing meant I was mastering nothing. My approach now is to identify the 1-2 channels that bring the best results and focus all my energy there, ditching the rest. I'll support these with email automation and retargeting and make landing page optimisation my top priority once I have a glimmer of PMF.\n\n# Mistake #7: We dedicated a whole MONTH to our Product Hunt launch. It should have taken two days.\n\nProduct Hunt used to be a powerful launchpad. Now, many founders feel its value is diminished. We didn't know this, so we spent a month preparing a campaign. In the end, our tool wasn't even featured on the main page due to a bug. I later learned this is a common story. Even \"Product of the Day\" often yields little in tangible results.\n\n**Conclusion #7:** I definitely won't get caught up in the Product Hunt hype again. My strategy now is to treat it simply as a good backlink and a community announcement. I'll create the page, notify users, post on social if featured, and move on.\n\n# Mistake #8: We wrote too many emails for our automation workflow (25 of them!).\n\nOur email onboarding sequence has over 25 emails. Surprisingly, they work and convert users. But having so many makes it incredibly challenging to analyse and optimise them effectively.\n\n**Conclusion #8:** I now believe a thoughtful workflow with 7-10 high-quality emails is far better than our sequence of 25 average ones. My future focus will be on quality over quantity, as it's easier to manage, test, and improve. Email marketing is still a fantastic channel I plan to leverage properly.\n\n# Mistake #9: We relied on the 'Lean Startup' principle too much. Instead, you should focus on quality right after validating demand.\n\nI love the Lean Startup methodology, but I used it as an excuse. Instead of perfecting a feature or a channel that was already working, I had a habit of saying, \"we'll improve this later\" while chasing other hypotheses. This created significant technical and marketing debt. I'm now a much bigger fan of the MLP (Minimum Lovable Product) principle.\n\n**Conclusion #9:** I now see that after proving my key product hypothesis (getting the first paying customers), I should have switched from pure \"lean\" mode to a more polished approach. My new philosophy is that one great, well-built feature works better than ten average ones.\n\n# Mistake #10: Our landing page was part of the web app, which is terrible for SEO.\n\nWe launched with a monolithic architecture. This is fast for initial development but hurts technical SEO and makes launching a blog a complete pain. We later migrated our marketing site to Webflow, which I wish we had done from the start – now it looks much better.\n\n**Conclusion #10:** I learned the hard way that landing pages and blogs should be static pages. For any future project, I'll use a platform like Webflow from day one and ensure everything is on the same root domain using subfolders for better SEO performance.\n\n# Mistake #11: Not having enough developers on your founding team\n\nAt the start, there were only two of us. My partner is a brilliant CTO but is part-time at another startup. Our limited development bandwidth, combined with other mistakes, meant we couldn't always keep pace. We’ve since fixed this by bringing on more help.\n\n**Conclusion #11:** I now understand that a startup team must have at least one full-time developer completely dedicated to the product. Without that, I've seen firsthand that the speed of iteration suffers immensely.\n\n# Mistake #12: Don't pitch for funding until you hit at least $3,000 MRR (unless you're Sam Altman).\n\nI looked at the startup-investor world through rose-coloured glasses. I thought because we were in a promising industry with early traction, securing pre-seed funding would be easy. After twenty pitches, we concluded that until your product has at least $3,000 MRR, there is little point in pitching to most investors.\n\n**Conclusion #12:** I wasted a lot of time chasing investors too early. My personal rule now is not to pitch seriously until the product is generating at least $3,000 MRR, with $5,000 being a much better benchmark to aim for.\n\n# Mistake #13: We didn't set up a referral programme from Day 0\n\nWord-of-mouth was our most powerful growth channel, yet we didn't implement a reward programme, assuming it would be too complicated to build. We were wrong. Off-the-shelf solutions like PromoteKit or TrackDesk exist.\n\n**Conclusion #13:** I was wrong to assume a referral program was complex. For any new product, I will launch a referral marketing programme from Day 0 using a dedicated tool. It’s much easier than I thought and can create a powerful acquisition channel.\n\n# Mistake #14: We ignored collecting reviews on sites like G2 for too long\n\nG2 provides a powerful backlink, high-intent traffic, and new customers. We thought setting up a profile would take too long, so we only did it a year and a half after launching. It took us just half an hour.\n\n**Conclusion #14:** I now see that setting up G2 and Capterra profiles early is crucial. In the future, I'll do this from the start and begin asking happy customers for reviews as soon as possible. This social proof is our online reputation.\n\n# Mistake #15: We ignored SEO for too long.\n\nWe built up a decent Domain Authority organically but wasted this asset by not building a proper keyword strategy or acquiring backlinks. As a result, we get some organic traffic, but not nearly as much as we could.\n\n**Conclusion #15:** I regret ignoring SEO for so long. My strategy from now on is to think about it from Day 0, identifying relevant long-tail keywords and aiming to build at least one high-quality backlink per month once I have PMF.\n\n# Final Thoughts: Focus, Quality, and Infrastructure\n\nIn a nutshell, my new philosophy, born from these mistakes, is:\n\n1. **Focus** on one core problem for one core audience.\n2. Find the joy in building something **lovable**, not just viable.\n3. Build foundational **infrastructure** from Day 0.\n4. **Talk to your users** constantly.\n\nI hope sharing this journey is useful. I'd be very interested to hear your own stories, feedback on my conclusions, and any mistakes I might still be making. I wish you wouldn't make mistakes like me :D"
  },
  {
    "id": "1loxxfn",
    "subreddit": "SideProject",
    "title": "15 AI startup mistakes I did with my first product, Aiter.io (and how you can avoid them)",
    "author": "MonkDi",
    "created_utc": 1751364865.0,
    "score": 372,
    "num_comments": 50,
    "url": "https://www.reddit.com/gallery/1loxxfn",
    "permalink": "https://www.reddit.com/r/SideProject/comments/1loxxfn/15_ai_startup_mistakes_i_did_with_my_first/",
    "selftext": "Hey, dear fellow side project hustlers! This is gonna be quite a long post (previous ones were shorter) because I will be sharing my experience from mistakes with my first side project and I made them a lot! 😁 \n\n**My first startup gave me grey hairs at 31**, yet I don’t regret a thing. I just wish someone had told me the things I’m about to share right at the beginning of my founder journey – maybe I could have avoided some of these costly startup mistakes. But hey, perhaps my story can save some time and stress for other entrepreneurs treading the same path? That's why I'm sharing it here\n\nA year and a half ago, my friend Val and I launched [Aiter.io](https://aiter.io/) – an AI MarTech startup designed to generate ads, social media content, and marketing strategy with a single click. We followed the classic MVP (Minimum Viable Product) playbook, building and launching it in just two weeks. It looked ugly as f\\*\\*k and was essentially just a one-click AI ad generator (screenshot 2 in the gallery).\n\nBut we got our first positive user feedback and early traction, so we decided to push forward. And that’s where my long journey of pain, joy, and crucial lessons began.\n\n# Mistake #1: We didn't implement signup and payments from Day 0 and lost out on 50,000 potential users\n\nAdding a simple email signup and basic Stripe integration is only 2-3 days of development work. Yet we didn't do it, deciding to go \"lean\" to test our core hypothesis. As we discovered, this was *too* lean.\n\nA French TikToker found our product and [posted a review](https://vm.tiktok.com/ZMSQywgum) (without us even knowing). It got 700k views overnight, driving 50,000 people to our website who wanted to try our AI tool. Because our product was free and didn't require a signup, we lost the massive opportunity to even collect their email addresses, not to mention any potential for monetisation. Of course, we added signups and Stripe later, but we've never had a viral traffic spike like that since.\n\n&gt;**Conclusion #1:** Don't be *too* lean. Always integrate basic user registration and a monetisation option (like Stripe) into your MVP from day one. This doesn't just prepare you for surprise traffic; it gives you much clearer data on whether users find your product valuable enough to pay for it.\n\n# Mistake #2: I resigned from my full-time job too early. It’s better to keep your side project a side one until you hit at least ~$5,000 in MRR\n\nAfter securing our first stable revenue (around $300-$500 a month 😁), I was convinced that scaling the business would be easy. I thought I just needed to invest X to get Y. After all, I’d spent 10 years in marketing! So, I switched to the full startup mode.\n\nGosh, that was a huge mistake. Because I only had savings for three months, growing a SaaS startup wasn’t as straightforward as I’d imagined. When my savings ran out, I had to start juggling multiple freelance jobs to pay the bills, which ended up taking even more time than my full-time role.\n\n&gt;**Conclusion #2:** If your main income is from a full-time job, don't quit to go all-in on your startup until its MRR is stable and can comfortably cover the salaries of all full-time founders/employees. Living in London, that benchmark for me would be at least $5,000 MRR (which we haven’t achieved yet 😁).\n\n# Mistake #3: I only had three months' worth of savings. It's better to have six, but the safest option is twelve. This is your startup runway\n\nWhen I ran out of savings, I fell into a vicious cycle: freelancing for my bread and butter, and only working on the startup with what little time was left. As a result, its MRR grew very slowly (we're currently at \\~$1,000-1,500), and we had no funds to reinvest in growth or marketing.\n\nThis meant we moved slower than the market and began to lose our competitive advantage. We’ve since course-corrected by bringing on an awesome new team member (more on that later), but if I’d had a longer financial runway, we could have scaled much faster.\n\n&gt;**Conclusion #3:** Before you go \"full-time founder\", make sure you have a financial safety net. Aim for at least six months of living expenses in savings. A year's worth is even better.\n\n# Mistake #4: We didn't set up product analytics (like Amplitude, GA4, and Clarity) from Day 0\n\nAnother of our \"too lean\" mistakes was neglecting to implement product analytics from launch. Because of this, we had no clear data on which features our users loved the most, which directly led to Mistake #5.\n\n&gt;**Conclusion #4:** Set up your product analytics *before* you launch. It might take a day, but it will give you invaluable insights into user behaviour and help you find product-market fit. I'm a fan of Amplitude for its flexibility. However, you could also try Mixpanel, or if these tools are too complex for your team, start with a basic event tracking setup in Google Analytics 4. Microsoft Clarity is a must-have – it’s free and shows you session recordings of your users, which will help you improve your UX and product.\n\n# Mistake #5: We went too broad with features instead of focusing on one core area and making it awesome\n\nInitially, Aiter only generated ad copy for Google, Facebook, and Instagram. I wish we’d stuck to that, focused on improving our product solely for the PPC market, and served that one niche audience.\n\nInstead, I fell into the classic trap of building a product \"for myself.\" As a full-stack marketer, over time, we added features for SMM, AI blog writing, email generation, and marketing strategy creation. As a result, our tool looks like this now (screenshot 3 in the gallery).\n\nSome might say it's cool that we have so many features. But this \"feature creep\" brings a whole bunch of problems:\n\n* The user onboarding process is more complex, which increases the learning curve and scares some potential customers away.\n* We now compete with much bigger, more established players than we should.\n* Managing and maintaining all these features is quite tiresome.\n* It's better to have one killer feature that stands out in the market than ten \"meh\" ones.\n* Marketing a broad, multi-feature tool is much harder than marketing a specialised solution.\n\nWe are now making changes to merge some features and make Aiter both more compact and useful. We are also considering launching a side project from our side project, just to test the hypothesis of how a more focused product might perform.\n\n&gt;**Conclusion #5:** Focus on a niche market segment and the core features that serve it. It is far better to be the best solution for a small group than an average one for a broad audience. This is the path to achieving true product-market fit.\n\n# Mistake #6: We went too broad with our marketing, too. It would have been better to focus on mastering just 1-2 channels\n\nWe wanted to discover what worked best for us, so we tried everything:\n\n* Startup and AI Directories\n* Google Ads\n* Meta Ads\n* Reddit Ads and organic posts\n* YouTube content marketing\n* Social Media Marketing (SMM) on LinkedIn\n* AI blogging for SEO\n* Email marketing\n\nAs a result, we achieved a little bit here and a little bit there – but mastered nothing. In hindsight, it would have been much better to stick to 1-2 primary acquisition channels and 1-2 supporting ones, and no more.\n\n**What worked well for our AI startup:**\n\n* **Startup and AI Directories.** We became the [\\#1 content generation tool on TAAFT](https://theresanaiforthat.com/s/aiter/), which consistently brings us high-quality leads and paying customers. Other directories also scraped our profile and listed us for free, which drove some good traffic.\n* **Organic Influencer Marketing.** A few influencers found our tool and reviewed it, which brought some good traffic spikes. However, proactively finding the right influencers proved to be a problem, as the outreach process is tiresome, complex, and can be expensive. (We are currently considering working with influencer marketing platforms – if you can recommend any, let me know!).\n* **YouTube Content Marketing** **(The Slow Burn).** We created [eight educational videos](https://www.youtube.com/@aiter_io) about Aiter and digital marketing and saw a small spike in sales. However, to get substantial results from a YouTube marketing strategy, you need to be very systematic. We are considering investing more time here.\n* **Google Ads Retargeting.** Showing ads to people who had already visited our website helped increase conversions. It was satisfying to use our own product to create ads that targeted different customer needs and objections.\n* **Email Marketing Workflows.** This works well for us in terms of converting users who signed up for our free version into paying customers.\n\n**What didn’t work for us:**\n\n* **Paid Ads (Meta, Google &amp; Reddit).** This doesn’t mean the channels are ineffective; it just means you need a much larger advertising budget and a highly optimised landing page than we had. Our $500/month budget wasn't sufficient to get anywhere near a positive ROI.\n* **Product Hunt.** More on this in Mistake #7.\n* **AI Blogging for SEO.** We found that purely AI-generated articles don't rank well. Writing and promoting genuine, high-quality articles takes a lot of time and is a mid- to long-term content strategy.\n* **SMM.** I can’t say it doesn’t work, but to get real results, it requires your full-time attention, which we couldn't afford. We are considering focusing more on LinkedIn or X (formerly Twitter), but I am more inclined to lean on YouTube.\n* **Conversion Rate Optimisation (CRO).** Our landing page isn’t bad, but it could be much better. Because we were spread too thin across so many marketing activities, we dedicated too little time to landing page optimisation. This is a critical oversight that takes time to fix.\n\n&gt;**Conclusion #6:** Identify the 1-2 marketing channels that bring you the best results and focus all your energy there. Ditch the rest. Support these primary channels with **e**mail automation workflows and retargeting ads to convert leads. And once you have a glimmer of product-market fit, make landing page optimisation your top priority.\n\n# Mistake #7: We dedicated a whole MONTH to our Product Hunt launch. It should have taken two days\n\nProduct Hunt used to be a cool place to launch a product, get your first clients, attract media attention, and maybe even find an investor. Now, many founders feel it’s full of bots, you can't guarantee you'll be featured on the main page, and the results in terms of actual sales or user acquisition are often minuscule.\n\nWe didn't know this when we decided to launch, so we spent a month preparing the campaign and building a network of contacts to support it. In the end, our tool wasn't even featured on the main page due to a bug that the Product Hunt team acknowledged later. [We got the most upvotes on the day](https://www.producthunt.com/products/aiter-io), but because we weren’t featured, it meant nothing.\n\nLater, talking to fellow founders in startup communities, I found out that this is a common story. Even becoming \"Product of the Day\" often gives you very little in terms of tangible results because, for many, the Product Hunt launch process has become a cargo cult.\n\n&gt;**Conclusion #7:** Don't get caught up in the hype of a Product Hunt launch. Create your launch page, ask your existing users and friends to subscribe to be notified, and if you get featured, post about it on your social channels. That’s it. Treat it as a good backlink for SEO and a small community announcement, nothing more.\n\n# Mistake #8: We wrote too many emails for our automation workflow (25 of them!)\n\nOur email onboarding sequence has over 25 emails. At least half of them were AI-generated. Surprisingly, they work and they do convert users. But having so many emails in the sequence makes it incredibly challenging and time-consuming to analyse and optimise them effectively.\n\n&gt;**Conclusion #8:** A well-designed and thoughtful email automation workflow with 7-10 high-quality emails is far better than a sequence of 25 average ones. It's easier to manage, test, and improve. And make no mistake: email marketing is still a fantastic channel for SaaS user conversion.\n\n# Mistake #9: We relied on the 'Lean Startup' principle too much. Instead, you should focus on quality right after validating demand\n\nI love the Lean Startup methodology – the cycle of creating an MVP, checking for traction, and then improving iteratively. I use it in both product development and marketing. But I used it *too much*.\n\nInstead of perfecting a feature or a marketing channel that was already working, I had a habit of saying, \"we'll improve this later\" while I chased other hypotheses. However, this creates significant technical debt and marketing debt. At some point, I realised I had to \"come back and improve\" far too many things, which was overwhelming.\n\nSo now, I'm a much bigger fan of the MLP (Minimum Lovable Product) principle. This means building a minimal product that is not just *viable*, but *lovable*. It means dedicating more time and care to whatever you do, whether it's building a new feature, recording a YouTube video, or writing a blog post.\n\n&gt;**Conclusion #9:** After you prove your key product hypothesis (i.e., you've got your first paying customers), switch from the pure \"lean\" mode to a more polished approach. One great, well-built feature works better than ten average ones. The same principle applies to your marketing content—quality always trumps quantity.\n\n# Mistake #10: Our landing page was part of the web app, which is terrible for SEO. Use Webflow or a similar platform for your static pages\n\nWe launched Aiter using a monolithic architecture, combining our public-facing landing page and the app itself. While this is fast for initial development, it hurts your technical SEO, and launching a blog becomes a complete pain in the arse.\n\nLater, we migrated our marketing site and blog to Webflow, which is a far more flexible and SEO-friendly option. I wish we had done so from the start – it would have saved us a lot of time.\n\n&gt;**Conclusion #10:** Your landing pages and blog should be static pages, separate from your app's code. The best way to do this is with a platform like Webflow or WordPress. Crucially, make sure both the app and the marketing site are on the same root domain (using subfolders like example.com/blog instead of subdomains like blog.example.com). It's a bit trickier to set up, but it's much better for SEO performance, as Google consolidates all ranking signals to one domain.\n\n# Mistake #11: Not having enough developers on your founding team\n\nAt the start, there were only two of us. My partner, Val, is a brilliant CTO, but he is also a full-time co-founder at another startup, so his involvement with Aiter is part-time. This was fine initially, but over time, we noticed that our limited development bandwidth, combined with the other strategic mistakes listed here, meant we couldn't always keep pace with the market.\n\nWe’ve since fixed this by bringing on another great developer and UX designer, Oleg, and we are also considering onboarding more developers. However, it's much better to have enough engineering firepower from day one.\n\n&gt;**Conclusion #11:** Your startup team should have at least one full-time developer completely dedicated to the product. Without it, your speed of iteration will suffer.\n\n# Mistake #12: Don't pitch for funding until you hit at least $3,000 MRR (unless your product is research-heavy or you're Sam Altman)\n\nI looked at the whole startup-investor world through rose-coloured glasses. I thought that because we were in a promising industry and had some early traction, securing a pre-seed funding round would be easy.\n\nWe had around twenty pitches, which was good practice. However, we quickly came to the conclusion (later verified by other founders I know) that until your product has at least $3,000 in Monthly Recurring Revenue, there is little point in pitching to most investors. We did find one interested party, but the term sheet they offered was not too good. We also applied for some startup grants, and while we've had some progress there, the process is incredibly tedious and long. It's an \"apply and forget\" kind of thing.\n\n&gt;**Conclusion #12:** Don't waste your time chasing investors until your product is generating at least $3,000 MRR. Hitting $5,000 is an even better benchmark. This advice doesn't apply to research-heavy products or serial entrepreneurs who have successfully raised funds before.\n\n# Mistake #13: We didn't set up a referral programme from Day 0\n\nWord-of-mouth is one of the most powerful growth channels (and it was the main one for us). However, we didn't implement a reward programme for users who invited others because we assumed it would be too complicated to build. We lost a lot of great opportunities this way, as users kept asking us for a referral scheme.\n\nWe were wrong – there are off-the-shelf solutions that allow you to set up a programme very quickly. We're in the process of integrating PromoteKit right now, and we also considered TrackDesk as an alternative.\n\n&gt;**Conclusion #13:** Launch a referral marketing programme from Day 0 using a dedicated tool. It’s much easier than it seems and creates a powerful, self-sustaining customer acquisition channel.\n\n# Mistake #14: We ignored collecting reviews on sites like G2 for too long\n\nG2 is a top website for B2B software reviews. If your product has positive reviews there, you get a powerful backlink, as well as high-intent traffic and new customers.\n\nWe thought setting up a profile would take too long, which is why we only did it a year and a half after launching. [It took us just half an hour](https://www.g2.com/products/aiter-io/reviews) 😁\n\n&gt;**Conclusion #14:** Set up your G2 and Capterra profiles right from the start. Ask your happy customers for reviews as soon as possible. This social proof is your online reputation and will boost growth at every stage of your marketing funnel.\n\n# Mistake #15: We ignored SEO for too long\n\nWe built up a decent Domain Authority organically through directory listings and word-of-mouth. However, we wasted this asset by neglecting to build a proper semantic core (keyword strategy) or strategically acquire backlinks. As a result, we get some organic traffic, but not nearly as much as we could.\n\n&gt;**Conclusion #15:** Think about your startup SEO strategy from Day 0. Identify relevant long-tail keywords to target and use them in your page titles, meta descriptions, and headings. Once you have product-market fit, aim to build at least one high-quality backlink per month. It's a long-term investment that really pays off.\n\n# Conclusion of conlusions: focus, have fun, talk to users, and set up infrastructure from Day 0\n\nIn a nutshell, I'd recommend:\n\n* **Focus on one core problem for one core audience.** Don't get distracted by building a tool for everyone. Master your niche first.\n* **Find the joy in building something** ***lovable*****, not just** ***viable*****.** Once you have early traction, shift your mindset from a scrappy MVP to a polished, high-quality product that users genuinely love.\n* **Build your foundational infrastructure from Day 0.** This includes product analytics, basic SEO, and a process for collecting reviews. Don't create technical and marketing debt you'll have to pay back later.\n* **Talk to your users constantly.** They are your ultimate source of truth and your best guide for finding product-market fit.\n\nI hope that sharing my **founder journey** – mistakes and all – helps other entrepreneurs on this path save some time, stress, and money. \n\nPlease share your tools, questions, feedback and mistakes – I will be happy to hear your story, discuss and exchange experiences. May the Force of all startup spirits be with you 😉"
  },
  {
    "id": "1fucc5r",
    "subreddit": "SideProject",
    "title": "I retired at 32 from my side project. Here's the path I took.",
    "author": "inputorigin",
    "created_utc": 1727862349.0,
    "score": 316,
    "num_comments": 153,
    "url": "https://www.reddit.com/r/SideProject/comments/1fucc5r/i_retired_at_32_from_my_side_project_heres_the/",
    "permalink": "https://www.reddit.com/r/SideProject/comments/1fucc5r/i_retired_at_32_from_my_side_project_heres_the/",
    "selftext": "**EDIT 2**: Thanks for the award kind stranger! I've stopped responding to reddit comments for this post. I'm adding an FAQ to the [original post](https://inputorigin.com/i-retired-at-32-heres-the-path-i-took/) based on the most common high quality questions. If you have a question that you're dying to know the answer to and that only I can help you with (vs. Google, ChatGPT, etc.), DM me. \n\n**EDIT**: I love how controversial this post has become (50% upvote rate), and only in this subreddit (vs. other subreddits that I posted the same content in). I trust that the open-minded half of you will find something useful in this post and my other posts and comments.\n\nI retired at 32 years old, in large part thanks to a B2C SaaS app that I developed on my own. Now, I don't have to work in order to cover my living expenses, and wouldn't have to work for quite a while.\n\nIn other words, I can finally sip mai tais at the beach.\n\nI've condensed how I got there into this post. First, a super simplified timeline of events, followed by some critical details.\n\n# Timeline\n\n* 2013 Graduated college in the US\n* 2013 Started first corporate job\n* 2013 Started side project (B2C app) that would eventually lead to my retirement\n* 2020 Started charging for use of my B2C app (was free, became freemium)\n* 2021 Quit my last corporate job\n* 2022 Retired: time freedom attained\n\n# Details\n\nFirst, some summary statistics of my path to retirement:\n\n* 9 years: time between graduating college and my retirement.\n* 8 years: total length of my career where I worked at some corporate day job.\n* 7 years: time it took my B2C app to make its first revenue dollar\n* 2 years: time between my first dollar of SaaS revenue and my retirement.\n\n\"Something something overnight success a decade in the making\".\n\nI got extremely lucky on my path to retirement, both in terms of the business environment I was in and who I am as a person. I'd also like to think that some of the conscious decisions I made along the way contributed to my early retirement.\n\n# Lucky Breaks\n\n* Was born in the US middle class.\n* Had a natural affinity for computer programming and entrepreneurial mindset (initiative, resourcefulness, pragmatism, courage, growth mindset). Had opportunities to develop these mindsets throughout life.\n* Got into a good college which gave me the credentials to get high paying corporate jobs.\n* Was early to a platform that saw large adoption (see [\"barnacle on whale\" strategy](https://dexa.ai/s/j5pnl-ZW?ref=inputorigin.com)).\n* Business niche is shareworthy: my SaaS received free media.\n* Business niche is relatively stable, and small enough to not be competitive.\n\n# \"Skillful\" Decisions\n\n* I decided to spend the nights and weekends of my early career working on side projects in the hopes that one would hit. I also worked a day job to support myself and build my savings.\n* My launch funnel over roughly 7 years of working on side projects:\n   * Countless side projects prototyped.\n   * 5 side projects publically launched.\n   * 2 side projects made &gt; $0.\n   * 1 side project ended up becoming the SaaS that would help me retire.\n* At my corporate day jobs, I optimized for learning and work-life balance. My learning usually stalled after a year or two at one company, so I’d quit and find another job.\n* I invested (and continute to do so) in physical and mental wellbeing via regular workouts, meditation, journaling, traveling, and good food. My fulfilling non-work-life re-energized me for my work-life, and my work-life supported my non-work-life: a virtuous cycle.\n* I automated the most time-consuming aspects of my business (outside of product development). Nowadays, I take long vacations and work at most 20 hours a week / a three-day work week .\n* I decided to keep my business entirely owned and operated by me. It's the best fit for my work-style (high autonomy, deep focus, fast decision-making) and need to have full creative freedom and control.\n* I dated and married a very supportive and inspiring partner.\n* I try not to succumb to outrageous lifestyle creep, which keeps my living expenses low and drastically extends my burn-rate.\n\n# Prescription\n\nTo share some aphorisms I’ve leaned with the wantrepreneurs or those who want to follow a similar path:\n\n* **Maximize your at bats, because you only need one hit.** Bias towards action. Launch quickly. Get your ideas out into the real world for feedback. Perfect is the enemy of good. If you keep swinging and improving, you'll hit the ball eventually.\n* **Keep the big picture in mind.** You don't necessarily need a home-run to be happy: a base hit will often do the job. Think about what matters most to you in life: is it a lot of money or status? Or is it something more satisfying, and often just as if not more attainable, like freedom, loving relationships, or fulfillment? Is what you’re doing now a good way to get what you want? Or is there a better way?\n   * At more of a micro-level of \"keep the big picture in mind\", I often see talented wantrepreneurs get stuck in the weeds of lower-level optimizations, usually around technical design choices. They forget (or maybe subconsciously avoid) the higher-level and more important questions of customer development, user experience, and distribution. For example: “Are you solving a real problem?” or “Did you launch an MVP and what did your users think?”\n* **Adopt a growth mindset**. Believe that you are capable of learning whatever you need to learn in order to do what you want to do.\n* **The pain of regret is worse than the pain of failure.** I’ve noticed that fear of failure is the greatest thing holding people back from taking action towards their dreams. Unless failure means death in your case, a debilitating fear of failure is a surmountable mental block. You miss 100% of the shots you don't take. When all is said and done, we often regret the things we didn't do in life than the things we did.\n* **There’s more to life than just work.** Blasphemous (at least among my social circle)! But the reality is that many of the dying [regret having worked too much in their lives](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3377309/?ref=inputorigin.com).\n\nAs Miss Frizzle from The Magic Schoolbus says: \"**Take chances, make mistakes, get messy!**\"\n\n[Original post](https://inputorigin.com/i-retired-at-32-heres-the-path-i-took/)"
  },
  {
    "id": "1jtgpoh",
    "subreddit": "microsaas",
    "title": "After 20 Failures, I Finally Built A SaaS That Makes Money 😭 (Lessons + Playbook)",
    "author": "FI_investor",
    "created_utc": 1744016042.0,
    "score": 326,
    "num_comments": 78,
    "url": "https://www.reddit.com/r/microsaas/comments/1jtgpoh/after_20_failures_i_finally_built_a_saas_that/",
    "permalink": "https://www.reddit.com/r/microsaas/comments/1jtgpoh/after_20_failures_i_finally_built_a_saas_that/",
    "selftext": "Years of hard work, struggle and pain. 20 failed projects 😭\n\nBuilt it in a few days using Ruby on Rails, PostgreSQL, Digital Ocean, OpenAI, Kamal, etc...\n\nLessons:\n\n* Solve real problems (e.g, save them time and effort, make them more money). Focus on the pain points of your target customers. Solve 1 problem and do it really well.\n* Prefer to use the tools that you already know. Don’t spend too much time thinking about what are the best tool to use. The best tool for you is the one you already know. Your customers won't care about the tools you used, what they care about is you're solving the problem that they have.\n* Start with the MVP. Don't get caught up in adding every feature you can think of. Start with a Minimum Viable Product (MVP) that solves the core problem, then iterate based on user feedback.\n* Know your customer. Deeply understand who your customer is and what they need. Tailor your messaging, product features, and support to meet those needs specifically.\n* Fail fast. Validate immediately to see if people will pay for it then move on if not. Don't over-engineer. It doesn't need to be scalable initially.\n* Be ready to pivot. If your initial idea isn't working, don't be afraid to pivot. Sometimes the market needs something different than what you originally envisioned.\n* Data-driven decisions. Use data to guide your decisions. Whether it's user behavior, market trends, or feedback, rely on data to inform your next steps.\n* Iterate quickly. Speed is your friend. The faster you can iterate on feedback and improve your product, the better you can stay ahead of the competition.\n* Do lots of marketing. This is a must! Build it and they will come rarely succeeds.\n* Keep on shipping 🚀 Many small bets instead of 1 big bet.\n\n**Playbook that what worked for me (will most likely work for you too)**\n\nThe great thing about this playbook is it will work even if you don't have an audience (e.g, close to 0 followers, no newsletter subscribers etc...).\n\n**1. Problem**\n\nCan be any of these:\n\n* Scratch your own itch.\n* Find problems worth solving. Read negative reviews + hang out on X, Reddit and Facebook groups.\n\n**2. MVP**\n\nSet an appetite (e.g, 1 day or 1 week to build your MVP).\n\nThis will force you to only build the core and really necessary features. Focus on things that will really benefit your users.\n\n**3. Validation**\n\n* Share your MVP on X, Reddit and Facebook groups.\n* Reply on posts complaining about your competitors, asking alternatives or recommendations.\n* Reply on posts where the author is encountering a problem that your product directly solves.\n* Do cold and warm DMs.\n\nOne of the best validation is when users pay for your MVP.\n\nWhen your product is free, when users subscribe using their email addresses and/or they keep on coming back to use it.\n\n**4. SEO**\n\nROI will take a while and this requires a lot of time and effort but this is still one of the most sustainable source of customers. 2 out of 3 of my projects are already benefiting from SEO. I'll start to do SEO on my latest project too.\n\nThat's it! Simple but not easy since it still requires a lot of effort but that's the reality when building a startup especially when you have no audience yet.\n\nLeave a comment if you have a question, I'll be happy to answer it.\n\nP.S. The SaaS that I built is a [tool that automates finding customers](https://customerfinderbot.com/) from social media. Basically saves companies time and effort since it works 24/7 for them. Built it to scratch my own itch and surprisingly companies started paying for it when I launched the MVP and it now grew to hundreds of customers from different countries, most are startups."
  },
  {
    "id": "1ixrzmh",
    "subreddit": "SaaS",
    "title": "Please stop. People hate talking to AI.",
    "author": "hotdoogs",
    "created_utc": 1740479514.0,
    "score": 234,
    "num_comments": 102,
    "url": "https://www.reddit.com/r/SaaS/comments/1ixrzmh/please_stop_people_hate_talking_to_ai/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1ixrzmh/please_stop_people_hate_talking_to_ai/",
    "selftext": "I see that eveybody is trying to automate and AI everything. From a business perspective it seems like a good idea, but from a consumer's perspective it's an absolute f\\*cking nightmare.\n\ni don’t want ai-generated spam flooding my inbox and linkedin messages with fake personalization\n\ni don’t want to talk to an ai chatbot when i need to reschedule my flight\n\ni don’t want to receive ai-generated phone calls pretending to be human\n\ni don’t want ai avatars flooding my social media feeds with soulless, generic \"influencer\" content\n\ni don’t want ai responding to my customer support emails with copy-paste answers when i need real help\n\ni don’t want ai answering my call at a restaurant when i’m trying to make a reservation\n\ni don’t want ai deciding who gets hired based on \"optimized\" but biased algorithms\n\nI also don't want ai agents to run my fucking business. \n\nSeriously. solve problems that actually need solving instead of just AI-ing everything."
  }
]