{
  "post": {
    "id": "1fucc5r",
    "subreddit": "SideProject",
    "title": "I retired at 32 from my side project. Here's the path I took.",
    "author": "inputorigin",
    "created_utc": 1727862349.0,
    "score": 314,
    "num_comments": 153,
    "url": "https://www.reddit.com/r/SideProject/comments/1fucc5r/i_retired_at_32_from_my_side_project_heres_the/",
    "permalink": "https://www.reddit.com/r/SideProject/comments/1fucc5r/i_retired_at_32_from_my_side_project_heres_the/",
    "selftext": "**EDIT 2**: Thanks for the award kind stranger! I've stopped responding to reddit comments for this post. I'm adding an FAQ to the [original post](https://inputorigin.com/i-retired-at-32-heres-the-path-i-took/) based on the most common high quality questions. If you have a question that you're dying to know the answer to and that only I can help you with (vs. Google, ChatGPT, etc.), DM me. \n\n**EDIT**: I love how controversial this post has become (50% upvote rate), and only in this subreddit (vs. other subreddits that I posted the same content in). I trust that the open-minded half of you will find something useful in this post and my other posts and comments.\n\nI retired at 32 years old, in large part thanks to a B2C SaaS app that I developed on my own. Now, I don't have to work in order to cover my living expenses, and wouldn't have to work for quite a while.\n\nIn other words, I can finally sip mai tais at the beach.\n\nI've condensed how I got there into this post. First, a super simplified timeline of events, followed by some critical details.\n\n# Timeline\n\n* 2013 Graduated college in the US\n* 2013 Started first corporate job\n* 2013 Started side project (B2C app) that would eventually lead to my retirement\n* 2020 Started charging for use of my B2C app (was free, became freemium)\n* 2021 Quit my last corporate job\n* 2022 Retired: time freedom attained\n\n# Details\n\nFirst, some summary statistics of my path to retirement:\n\n* 9 years: time between graduating college and my retirement.\n* 8 years: total length of my career where I worked at some corporate day job.\n* 7 years: time it took my B2C app to make its first revenue dollar\n* 2 years: time between my first dollar of SaaS revenue and my retirement.\n\n\"Something something overnight success a decade in the making\".\n\nI got extremely lucky on my path to retirement, both in terms of the business environment I was in and who I am as a person. I'd also like to think that some of the conscious decisions I made along the way contributed to my early retirement.\n\n# Lucky Breaks\n\n* Was born in the US middle class.\n* Had a natural affinity for computer programming and entrepreneurial mindset (initiative, resourcefulness, pragmatism, courage, growth mindset). Had opportunities to develop these mindsets throughout life.\n* Got into a good college which gave me the credentials to get high paying corporate jobs.\n* Was early to a platform that saw large adoption (see [\"barnacle on whale\" strategy](https://dexa.ai/s/j5pnl-ZW?ref=inputorigin.com)).\n* Business niche is shareworthy: my SaaS received free media.\n* Business niche is relatively stable, and small enough to not be competitive.\n\n# \"Skillful\" Decisions\n\n* I decided to spend the nights and weekends of my early career working on side projects in the hopes that one would hit. I also worked a day job to support myself and build my savings.\n* My launch funnel over roughly 7 years of working on side projects:\n   * Countless side projects prototyped.\n   * 5 side projects publically launched.\n   * 2 side projects made &gt; $0.\n   * 1 side project ended up becoming the SaaS that would help me retire.\n* At my corporate day jobs, I optimized for learning and work-life balance. My learning usually stalled after a year or two at one company, so I’d quit and find another job.\n* I invested (and continute to do so) in physical and mental wellbeing via regular workouts, meditation, journaling, traveling, and good food. My fulfilling non-work-life re-energized me for my work-life, and my work-life supported my non-work-life: a virtuous cycle.\n* I automated the most time-consuming aspects of my business (outside of product development). Nowadays, I take long vacations and work at most 20 hours a week / a three-day work week .\n* I decided to keep my business entirely owned and operated by me. It's the best fit for my work-style (high autonomy, deep focus, fast decision-making) and need to have full creative freedom and control.\n* I dated and married a very supportive and inspiring partner.\n* I try not to succumb to outrageous lifestyle creep, which keeps my living expenses low and drastically extends my burn-rate.\n\n# Prescription\n\nTo share some aphorisms I’ve leaned with the wantrepreneurs or those who want to follow a similar path:\n\n* **Maximize your at bats, because you only need one hit.** Bias towards action. Launch quickly. Get your ideas out into the real world for feedback. Perfect is the enemy of good. If you keep swinging and improving, you'll hit the ball eventually.\n* **Keep the big picture in mind.** You don't necessarily need a home-run to be happy: a base hit will often do the job. Think about what matters most to you in life: is it a lot of money or status? Or is it something more satisfying, and often just as if not more attainable, like freedom, loving relationships, or fulfillment? Is what you’re doing now a good way to get what you want? Or is there a better way?\n   * At more of a micro-level of \"keep the big picture in mind\", I often see talented wantrepreneurs get stuck in the weeds of lower-level optimizations, usually around technical design choices. They forget (or maybe subconsciously avoid) the higher-level and more important questions of customer development, user experience, and distribution. For example: “Are you solving a real problem?” or “Did you launch an MVP and what did your users think?”\n* **Adopt a growth mindset**. Believe that you are capable of learning whatever you need to learn in order to do what you want to do.\n* **The pain of regret is worse than the pain of failure.** I’ve noticed that fear of failure is the greatest thing holding people back from taking action towards their dreams. Unless failure means death in your case, a debilitating fear of failure is a surmountable mental block. You miss 100% of the shots you don't take. When all is said and done, we often regret the things we didn't do in life than the things we did.\n* **There’s more to life than just work.** Blasphemous (at least among my social circle)! But the reality is that many of the dying [regret having worked too much in their lives](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3377309/?ref=inputorigin.com).\n\nAs Miss Frizzle from The Magic Schoolbus says: \"**Take chances, make mistakes, get messy!**\"\n\n[Original post](https://inputorigin.com/i-retired-at-32-heres-the-path-i-took/)"
  },
  "comments": [
    {
      "id": "lpybykc",
      "author": "GrabWorking3045",
      "body": "what's the app?",
      "created_utc": 1727863633.0,
      "score": 87,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpyngt4",
      "author": "Fit_Detective_8374",
      "body": "It's pretty doubtful you've made enough to support yourself for the next 50 years. Expecting your app to still be relevant for the next 10 or by some miracle 20 years is already a bit wild. Its also pretty suspect you refuse to share any meaning full details and think \"credibility is over rated\". This is either a troll post or OP is bad at math.\n\nBut most likely OP is just bragging as they posted this exact same thing all over the place in different subs",
      "created_utc": 1727869929.0,
      "score": 51,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpyyrgt",
      "author": "FancyName_132",
      "body": "Hi OP, I'll give you the benefit of the doubt and assume this is all true:\n\n* Does your retirement plan include your app's MRR ?\n* What's your app MRR ?\n* What was the number for you to decide to retire ? Some people need as little as $20k yearly passive income  while some want &gt;$200k\n* Why call yourself a retiree if you still work 20 hours a week on the regular ?\n* Why did you post a referral link to a get rich podcast ?",
      "created_utc": 1727874732.0,
      "score": 47,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpylzrc",
      "author": "escapevelocity1800",
      "body": "Am I crazy or is OP responding to their own posts with questions and feedback like they're not the OP? This sub is seemingly filled with karma chasers anymore.",
      "created_utc": 1727869245.0,
      "score": 44,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpyhcmn",
      "author": "sonicviz",
      "body": "So, you were lucky. Good for you!\n\nAlso, anon humblebragging is unseemly.",
      "created_utc": 1727866863.0,
      "score": 35,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpyd3fi",
      "author": "RakOOn",
      "body": "If you don't share the product then this is just useless and has no credibility whatsoever",
      "created_utc": 1727864356.0,
      "score": 37,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpz92th",
      "author": "[deleted]",
      "body": "[deleted]",
      "created_utc": 1727878486.0,
      "score": 24,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpysqru",
      "author": "CicadaAncient",
      "body": "This screams pure scam.",
      "created_utc": 1727872311.0,
      "score": 17,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpyoq6i",
      "author": "Master_Rooster4368",
      "body": "This post is basically you circle jerking yourself. What's another word for that? 🤔",
      "created_utc": 1727870519.0,
      "score": 18,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpytab8",
      "author": "sevenquarks",
      "body": "Bullshit",
      "created_utc": 1727872539.0,
      "score": 11,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpz3ymm",
      "author": "bodyreddit",
      "body": "I don’t understand why you posted to almost 10 subreddits..",
      "created_utc": 1727876688.0,
      "score": 7,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpz2x0g",
      "author": "heaton5747",
      "body": "There are zero revenue numbers",
      "created_utc": 1727876303.0,
      "score": 7,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzh0kg",
      "author": "EntreNerd",
      "body": "Not being a jerk here but the post seems fake without proof.\n\nI saw your comment that you want to preserve anonymity but telling about your product will not lead you to any kind of personal exposure.\n\nIt will only led to more recognition for your product. So, why don't you share it?",
      "created_utc": 1727881121.0,
      "score": 5,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq06xw0",
      "author": "UPVOTE_IF_POOPING",
      "body": "This post comes off as super pretentious. I find the advice to be generic and you come off as an enjoys-sniffing-his-own-farts kind of person. No offense.",
      "created_utc": 1727889350.0,
      "score": 5,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzv6z5",
      "author": "[deleted]",
      "body": "[deleted]",
      "created_utc": 1727885638.0,
      "score": 5,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzcuyh",
      "author": "bitemyassnow",
      "body": "the post's too long, can sb who read tell me if it's worth reading? so that I can throw the entire thing to chatgpt and read the one sentence summarized version.\n\nThanks!",
      "created_utc": 1727879762.0,
      "score": 3,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzd8wh",
      "author": "FauxReal",
      "body": "What's the app? I assume you have a company based on it? What does the app do? I'm curious what kind of niche you found that has worked so well for you in a short time.",
      "created_utc": 1727879889.0,
      "score": 3,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzdmwg",
      "author": "HaltingAnkl",
      "body": "Chat gpt",
      "created_utc": 1727880016.0,
      "score": 3,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzj8wc",
      "author": "swoorup",
      "body": "Well congrats if true. I am naturally a skeptic.",
      "created_utc": 1727881848.0,
      "score": 2,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzmn6q",
      "author": "zukos_destiny",
      "body": "It’s like you fed GPT all of levelsio’s tweets and are trying to make money off of pretending you did a 10th as well as him.",
      "created_utc": 1727882949.0,
      "score": 3,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzmq4z",
      "author": "zukos_destiny",
      "body": "Grifter",
      "created_utc": 1727882976.0,
      "score": 3,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzyzh0",
      "author": "Charming_Camera2340",
      "body": "OP says he made the post to provide value? Can’t see any value other than motivational mumbojumbo ",
      "created_utc": 1727886831.0,
      "score": 3,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzkiw5",
      "author": "zoidbergisawesome",
      "body": "Send me your course link",
      "created_utc": 1727882263.0,
      "score": 2,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq02hka",
      "author": "MorallyDeplorable",
      "body": "Go jerk off to your fantasies in private, man. The rest of us don't want to watch.",
      "created_utc": 1727887935.0,
      "score": 2,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq0m9wn",
      "author": "Catatonick",
      "body": "This looks like how ChatGPT spits out stories. \n\nI’m calling bs. You didn’t provide numbers, seem to ignore any post questioning the numbers, refuse to show the app in question for no reason, and claim credibility is overrated when the advice is as generic as can be. \n\nIf the story is legit you can say what the app is because there’s literally nothing wrong with doing so. I mean what’s the worst that can happen? People confirm the story and you get traffic to the app. \n\nYou know, unless you’re lying.",
      "created_utc": 1727894217.0,
      "score": 2,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq0mily",
      "author": "oyiyo",
      "body": "I don't know why people are mad. The advice is sound, and not wanting to disclose for anonymity and protecting a niche business makes sense too. \n\nMy questions: was it intentional into getting that specific niche? For people who are looking into a similar approach into a different domain, what characteristics or attributes of your approach/solution you think were critical to your success? In other words, what would you recommend to pay attention/optimize for to increasing your batting average ?",
      "created_utc": 1727894293.0,
      "score": 2,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq0oe78",
      "author": "worduniv",
      "body": "Prompt well done 👍  good for you",
      "created_utc": 1727894890.0,
      "score": 2,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq32v6l",
      "author": "Business-Towel-6548",
      "body": "Downvote the f out of this.  Btw I retired and living on an island",
      "created_utc": 1727926400.0,
      "score": 2,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lpzwj2a",
      "author": "No_Literature_7329",
      "body": "Profit that allows for this?",
      "created_utc": 1727886049.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq0b8db",
      "author": "kweefersutherlnd",
      "body": "Created account 8 hours ago just to post this on every subreddit who might listen to you?  Very uninspiring",
      "created_utc": 1727890700.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq0fa1k",
      "author": "technicallynotlying",
      "body": "Successful app developers market their apps aggressively. Why the reluctance to share? This is a ton of free marketing.\n\nIf you were concerned about anonymity, why didn't you create alt account? Doesn't your app have a social media presence?",
      "created_utc": 1727891971.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq104uq",
      "author": "WatercressMobile2927",
      "body": "Which programming language did you apply to these projects?",
      "created_utc": 1727898633.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq18dts",
      "author": "unclexbuck",
      "body": "“Get your ideas out into the real world” \nDid you publish your app to GitHub or anything like that to get feedback prior to launching? Or did you launch and worked on acquiring users?",
      "created_utc": 1727901233.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq18lnq",
      "author": "Used-Call-3503",
      "body": "congrats and good for you if this is true",
      "created_utc": 1727901300.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq1encr",
      "author": "The-Wanderer-001",
      "body": "Well if this isn’t the most vague post I’ve seen in here, idk what is",
      "created_utc": 1727903169.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq1jifl",
      "author": "rashnull",
      "body": "What valuation are you at?",
      "created_utc": 1727904731.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq1k0od",
      "author": "[deleted]",
      "body": "Why can’t you list the app name and where to find it ?",
      "created_utc": 1727904894.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq1o587",
      "author": "Flimsy-Brain-5557",
      "body": "did you create a gpt of alex hormozi and tell it to write this lol",
      "created_utc": 1727906285.0,
      "score": 1,
      "parent_id": "t3_1fucc5r",
      "depth": 0
    },
    {
      "id": "lq1uiv5",
      "author": "thebohoberry",
      "body": "That’s not how app works. Mostly likely his competitor bought his app. He made enough to invest to set him up for life. This is one of the most common exit strategies for SaaS products.",
      "created_utc": 1727908848.0,
      "score": 3,
      "parent_id": "t1_lpyngt4",
      "depth": 1
    },
    {
      "id": "lq0m6jn",
      "author": "ftr-mmrs",
      "body": "&gt; Why did you post a referral link to a get rich podcast ?\n\n\nWell, he did say: \"I automated the most time-consuming aspects of my business\". Had to make money somehow I guess.",
      "created_utc": 1727894188.0,
      "score": 8,
      "parent_id": "t1_lpyyrgt",
      "depth": 1
    },
    {
      "id": "lpyo9pt",
      "author": "andarmanik",
      "body": "I noticed this too, comments are astroturfed.",
      "created_utc": 1727870306.0,
      "score": 10,
      "parent_id": "t1_lpylzrc",
      "depth": 1
    },
    {
      "id": "lq26blp",
      "author": "[deleted]",
      "body": "I graduated Yale out of the womb and became a trillionaire at 10. Here's my secret but I can't tell you more because I signed a NDA with my mom.",
      "created_utc": 1727913501.0,
      "score": 18,
      "parent_id": "t1_lpz92th",
      "depth": 1
    },
    {
      "id": "lpzjlra",
      "author": "[deleted]",
      "body": "Multi level marketing is more transparent than this",
      "created_utc": 1727881965.0,
      "score": 6,
      "parent_id": "t1_lpysqru",
      "depth": 1
    },
    {
      "id": "lq9oeg6",
      "author": "[deleted]",
      "body": "If you follow these steps in my 9k course, just peanuts really when you know you're about to be ......",
      "created_utc": 1728027969.0,
      "score": 2,
      "parent_id": "t1_lpysqru",
      "depth": 1
    },
    {
      "id": "lq2f895",
      "author": "pyrosol08",
      "body": "It's spam lol it's always the ones you most suspect, come on now",
      "created_utc": 1727916909.0,
      "score": 2,
      "parent_id": "t1_lpz3ymm",
      "depth": 1
    }
  ],
  "fetched_at": 1755100742,
  "schema": "v1"
}