{
  "post": {
    "id": "1honjxa",
    "subreddit": "Entrepreneur",
    "title": "Quitting my 450K tech job to start my own business ",
    "author": "Lifeofcrazyfrog",
    "created_utc": 1735444727.0,
    "score": 505,
    "num_comments": 441,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1honjxa/quitting_my_450k_tech_job_to_start_my_own_business/",
    "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1honjxa/quitting_my_450k_tech_job_to_start_my_own_business/",
    "selftext": "Hey Reddit,\n\nI’m 36, originally from India and have been in the US since 2013 on an H1B visa. After a decade of dealing with corporate bureaucracy and soul-crushing tech sales (managing upwards and all that bootlicking—ugh), I finally got my green card in the summer of 2023.\n\nI’ve always hated trading time for money doing work I don’t care about. So, I’ve decided to take a leap. My wife and I are heading to India soon for six weeks with our 3-month-old baby. She quit her job in July, and we’ve been gearing up for a big shift in our lives.\n\nFinancially, we’re in a decent spot—we can cover our expenses for two years without dipping into retirement savings. With that safety net, I’m planning to leverage my knowledge of the US market, my network in India, and my background in tech and business to explore these three industries:\n\n1.\tLab-Grown Diamond Imports – Leveraging India’s expertise in diamond manufacturing and finding markets in the US.\n\n2.\tTextile Imports &amp; B2B Wholesale – Starting with Amazon FBA and eventually building a brand (long-term vision here).\n\n3.\tCountertop &amp; Tile Imports – Focused on B2B sales to US customers.\n\nI know these are all pretty different, but I’m hoping one of them clicks. I’m excited (and honestly, a little terrified) about taking the plunge into entrepreneurship after being in Corporate America my entire career.\n\nWish me luck! Am I crazy for leaving the relative “safety” of corporate America, or is this the leap I’ve always needed to take? Would love to hear your thoughts, advice, or success stories from anyone who’s done something similar!\n\n Edit : I am dropping 1 and 2- going all in on #3"
  },
  "comments": [
    {
      "id": "m4b0dty",
      "author": "Sunshine12e",
      "body": "Lab grown diamond will be a very SHORT term business. If you do not already have a going stone/jewellery business with customers and contacts, it will not be worth it. Prices have plummeted and will continue to plummet.",
      "created_utc": 1735445704.0,
      "score": 179,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b3n16",
      "author": "[deleted]",
      "body": "[deleted]",
      "created_utc": 1735447102.0,
      "score": 130,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4bnoh9",
      "author": "nsxn",
      "body": "Giving up 450k/ yr to sell textiles on Amazon?  Sorry, but hang on to that job and retire early.\n\nOr at least take a sabbatical.  You could also start any of these businesses on the side to at least learn if they are viable.",
      "created_utc": 1735457353.0,
      "score": 68,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4ayzzt",
      "author": "PrestigiousLeopard47",
      "body": "Good luck! Love the leaving a great job, but with a safety net and taking your learnings and experience with you. Sure it’ll go well 💪",
      "created_utc": 1735445139.0,
      "score": 66,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4bpwaq",
      "author": "tomrangerusa",
      "body": "Don’t leave your job until these side businesses start paying your rent.  Not even technology but old world import/export?\n\n450k are you crazy???",
      "created_utc": 1735458706.0,
      "score": 38,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b27a5",
      "author": "grubygrub",
      "body": "Why these 3? Is it because you are familiar with them or you know there is demand in the market for them? Don’t got for the “I have a hammer and want to find a good nail” approach vs going for, bunch of nails and make a hammer approach. Amazon FBA is hard these days, you need to sink at least 100-200k into it to replace your tech salary. In 2-3 years. If the FBA profit margin is say 10%, you need 4-5m worth of revenue. All the FBA niches are saturated. Countertop and tile - look at rates and countervailing duty rates if you are doing import export and how the next admin will impact you. There is a lot of opportunity in these markets where you don’t go direct to consumer - maybe builders or contractors? With your tech background, why not combine them and do 3d mockups of what builders want and then package/manufacture in India? Basically blue collar work is expensive in the US, but cheap overseas, the design/custom fab part is where the price delta comes from - iterate on that?",
      "created_utc": 1735446477.0,
      "score": 30,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b3uyg",
      "author": "JustTryinToLearn",
      "body": "Definitely crazy, but every person who started a business has to be a little crazy 😂",
      "created_utc": 1735447198.0,
      "score": 20,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b1vbq",
      "author": "yourbizbroker",
      "body": "Congratulations on your new adventure. \n\nReplacing your current income will require swift progress and success as a business owner. To shorten your timeline and increase your odds of success, consider purchasing an established business. \n\nA $450k income may require a $4M business purchase. A business of this size would require a $400k down payment and an SBA loan, which you are now eligible for as a permanent resident. Owning a qualifying business may also accelerate your path to citizenship, if that is a goal. \n\nIf you purchase a business that benefits from your tech background or connections in India, you may be able to immediately grow the business after the purchase. \n\nGood luck!",
      "created_utc": 1735446333.0,
      "score": 16,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4bajhj",
      "author": "Little_Ocelot_93",
      "body": "Man, you’re throwing away a 450K cakewalk for a risky business dream? That’s wild! Honestly, some people would kill for that corporate cushion. Bet you had perks, bonuses, and pretty damn good job security with that paycheck, right? Truth bomb: not everyone cracks it big in business. I get that you’re tired of the 9-to-5 grind, but dang, that’s a major leap. Hope you don’t end up kicking yourself over the decision, but hey, if you succeed, you’ll prove all the skeptics wrong. Best of luck, just make sure you don't end up wishing you had that tech gig back. Enjoy India!",
      "created_utc": 1735450258.0,
      "score": 16,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b76se",
      "author": "Luc_ElectroRaven",
      "body": "that's pretty insane - but all entrepreneurs are. At least you basically have it dialed into importing. That's good. \n\nThe only thing I would say is: \n\n&gt; but I’m hoping one of them clicks\n\nthis is the wrong mentality. If you hope for something to click, none of them will. You pick one and you MAKE it click. Period.",
      "created_utc": 1735448692.0,
      "score": 12,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4blny1",
      "author": "Hooptiehuncher",
      "body": "I can’t tell you if those are good ventures. What I can say is that I’ve always encouraged people to give entrepreneurship a try after having my own success. One question I always liked to ask is “if you fail, how quickly could you get another job similar to (or better than) what you initially left?” For the guy making $20/hr in the trades it’s a no brainer imo. You’re at a totally different income level, however. And your business may require substantially more capital and risk. I’m not saying don’t do it. But I do think these are healthy questions to ask yourself.",
      "created_utc": 1735456148.0,
      "score": 6,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4cxh0q",
      "author": "DaPudi",
      "body": "This is actually a bad idea in my opinion. You want to start a business in a new country (yes India is new to you) and that too in a new domain in which you have no experience.\n\nI have been in business for many years, so consider my 2 cents. You have in depth knowledge of IT which most bystanders wouldn't have, you need to leverage that information into an actionable business, not something new altogether.",
      "created_utc": 1735483449.0,
      "score": 6,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b0q5g",
      "author": "ZestycloseGur9056",
      "body": "My mom is in the jewelry business, lab grown diamonds are huge and very much in demand. December she sold a lot of lab grown diamond rings. We are also Indian and she travels to India for supplies and other stuff. It’s all about who you know in this business. Good luck!",
      "created_utc": 1735445845.0,
      "score": 6,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4bhq0j",
      "author": "kazinski80",
      "body": "Something I was told by a guy who left a very lucrative job as a lawyer to open a store in his niche hobby was this “Trading all of your time doing something you don’t believe in for money will crush your soul. There is no amount of money that’s worth that”\n\nI didn’t listen to him, and I regret it",
      "created_utc": 1735453940.0,
      "score": 6,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4azlo2",
      "author": "Necessary_Brush9543",
      "body": "The grass is always greener on the other side.",
      "created_utc": 1735445384.0,
      "score": 4,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b1m98",
      "author": "alexlazar98",
      "body": "You are a bit crazy, but this doesn't necessarily mean you shouldn't have done it. Good luck!\n\nEDIT: anyone leaving $450k for the unknown has to be a bit crazy 🤷🏻‍♂️",
      "created_utc": 1735446226.0,
      "score": 5,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4c18l5",
      "author": "Uk840",
      "body": "As somebody who just bought marble countertops from India, I can tell you that everyone who has seen them has asked me to give them the link to the shop, people love marble",
      "created_utc": 1735466075.0,
      "score": 3,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4cajhu",
      "author": "[deleted]",
      "body": "I got laid off from my w2 job and started a company in Jan 2023. 2 years later I’m doing 2m+ arr as a soloprenuer. If you don’t give up you’ll get there. I like the counter tops idea the best, but I think tariffs will be tough on all of these ideas and I think construction will slow massively in 2025 with interest rates.",
      "created_utc": 1735472089.0,
      "score": 4,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4ddqk9",
      "author": "Blarghnog",
      "body": "The mistake you’re (potentially) making is approaching this as if it’s just about the dream and the checkbook. \n\nInstead, you need to think like an investor and focus on traction. Right now, it’s more about escaping your corporate job than proving that your idea has early, measurable success.\n\nWhen you decide to go all in, it should be on evidence of traction. Betting on a dream is gambling, not strategy—though it may feel the same. The difference lies in whether you’ve validated your ideas with real data or just hope for a positive outcome.\n\nApproach this like any other project: gather early evidence, validate your assumptions, and use that proof to fuel your decisions. Don’t let your business become an escape hatch; let it be a well-thought-out venture.\n\nAs for books, here are a few that can help shape that mindset:\n\n- *The Lean Startup* by Eric Ries\n\n- *Zero to One* by Peter Thiel\n\n* *The Innovator’s Dilemma* by Clayton Christensen\n\n- *The Hard Thing About Hard Things* by Ben Horowitz\n\n- *The Art of the Start* 2.0 by Guy Kawasaki\n\n- *Nail It, Then Scale It* by Nathan Furr and Paul Ahlstrom\n\nThese books are good reads for your because they all, in different ways, emphasize evidence-based decision-making, traction, and avoiding the pitfalls of entrepreneurial dreams without validation.\n\nI teach a lot of people how to validate their business ideas, and it really does make a big difference to success and failure in early stage companies. \n\nRemember you are a business in search of a business model, and we invest in evidence. So get some.",
      "created_utc": 1735489153.0,
      "score": 5,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b7p23",
      "author": "Sastrykasibotla",
      "body": "Congratulations on your new venture and wish you all success.",
      "created_utc": 1735448925.0,
      "score": 3,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4bam7f",
      "author": "Gnss_Gis",
      "body": "Leaving a $450k job to start a business you’ve never run before? WTF.\n\nI’d suggest starting the business on the side first, or maybe having your wife run it in the beginning. Corporate jobs and running a small business are two completely different worlds. Speaking as someone who worked 9.5 years in corporate and has spent the last 6 years running my own business (now with 14 employees), it’s not easy. I busted my ass working 70-80 hours a week since I started and missed most family and friends’ events.\n\nAmazon FBA, Shopify, and similar ventures are often just a money pit. I have a relative who sells clothes this way, and she’s close to shutting the whole operation down. For the last few months, they’ve been drowning in debt and can’t even cover their expenses.",
      "created_utc": 1735450295.0,
      "score": 3,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4bptn1",
      "author": "Namehisprice",
      "body": "Fyi some major Indian tile tariffs likely on the horizon.\n\n[Source](https://www.nahb.org/blog/2024/04/tile-tariff)",
      "created_utc": 1735458659.0,
      "score": 3,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4ecdur",
      "author": "PM_ME_GOOD_WINES",
      "body": "Dumb as hell. All 3 ideas you have are heavily saturated with option one on the way out. You'd be better off keeping your 450k job and living like you make 30k a year and invest the rest and retire in 10 years. Ur gonna throw away that easy paycheck for bankruptcy and contractors telling you to fuck off.",
      "created_utc": 1735499825.0,
      "score": 3,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b1kyn",
      "author": "Responsible-Put-2629",
      "body": "Best of luck man 🤞",
      "created_utc": 1735446210.0,
      "score": 2,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b1vev",
      "author": "clear_grapefruit_",
      "body": "Nothing helpful to say I’m just excited to see what you do! Keep us posted!",
      "created_utc": 1735446334.0,
      "score": 2,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b4fxc",
      "author": "[deleted]",
      "body": "Read work 4 hour per week",
      "created_utc": 1735447454.0,
      "score": 2,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4bbsy2",
      "author": "pishangujeniya",
      "body": "I am from Surat city, which is world's top diamond producer city, Do let me know if you need any help in that direction.",
      "created_utc": 1735450878.0,
      "score": 2,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4bd7em",
      "author": "Lifeofcrazyfrog",
      "body": "Fair point! I have enough to take a calculated risk for a couple of years. These markets are competitive, but I’m banking on leveraging US-India connections and targeting niches to stand out.\n\nSemi-retirement sounds great, but I’m not ready to slow down yet—I’d rather swing for something I’m passionate about. Worst case, I fail and pivot, but at least I tried. Appreciate the perspective!",
      "created_utc": 1735451571.0,
      "score": 2,
      "parent_id": "t3_1honjxa",
      "depth": 0
    },
    {
      "id": "m4b23jy",
      "author": "brucekeller",
      "body": "Yeah when people sell their diamond wedding rings the pawn shops don't even count the diamonds towards their offer. Usually really shocks first-time divorcees. \n\nThat said, maybe could still make them for industrial use for things like lasers and cutting... probably kind of low margin though.",
      "created_utc": 1735446432.0,
      "score": 54,
      "parent_id": "t1_m4b0dty",
      "depth": 1
    },
    {
      "id": "m4b1oqk",
      "author": "Lifeofcrazyfrog",
      "body": "My close relative who is in business keeps telling me that. My childhood friend is saying the opposite. I think there should be a niche in the market that I can find. I will keep you posted on what I learn when I am on the ground there. Will be in Surat, India for 3 weeks, that’s diamond city of the Asia.",
      "created_utc": 1735446255.0,
      "score": 22,
      "parent_id": "t1_m4b0dty",
      "depth": 1
    },
    {
      "id": "m4b4h9y",
      "author": "Lifeofcrazyfrog",
      "body": "Good luck in your journey. It’s all about putting in the work and taking the action. You are doing the right thing.",
      "created_utc": 1735447472.0,
      "score": 19,
      "parent_id": "t1_m4b3n16",
      "depth": 1
    },
    {
      "id": "m4bulkg",
      "author": "arghhmonsters",
      "body": "Been seeing you in a few subs, hope it works out man",
      "created_utc": 1735461695.0,
      "score": 8,
      "parent_id": "t1_m4b3n16",
      "depth": 1
    },
    {
      "id": "m4dps5g",
      "author": "Healthy-Shallot8306",
      "body": "Good to know this is a common theme. On some days i’m on cloud nine and others i’m wondering what the hell i’m doing with my life. Either way, toughest part is making a decision and sticking to it - much easier said that done in this world of opportunity costs (there’s always going to be something better)",
      "created_utc": 1735492962.0,
      "score": 3,
      "parent_id": "t1_m4b3n16",
      "depth": 1
    },
    {
      "id": "m4bzcoj",
      "author": "meerkat2018",
      "body": "Yep. With that salary he can delegate to a hire or partner with someone in India to setup processes and test the waters. \n\nNo need right now to go all-in into the industry he has zero expertise in.",
      "created_utc": 1735464819.0,
      "score": 28,
      "parent_id": "t1_m4bnoh9",
      "depth": 1
    },
    {
      "id": "m4cqzmw",
      "author": "snowmanpl",
      "body": "100% this! Stay to your job and delegate and build on the side the business",
      "created_utc": 1735480739.0,
      "score": 4,
      "parent_id": "t1_m4bnoh9",
      "depth": 1
    },
    {
      "id": "m4azbqm",
      "author": "Lifeofcrazyfrog",
      "body": "TY! Learned a lot but somehow not connected with my work and needed a change to make life more fulfilling and not just be on zoom calls all day.",
      "created_utc": 1735445273.0,
      "score": 11,
      "parent_id": "t1_m4ayzzt",
      "depth": 1
    },
    {
      "id": "m4wbffu",
      "author": "[deleted]",
      "body": "[removed]",
      "created_utc": 1735762274.0,
      "score": 3,
      "parent_id": "t1_m4bpwaq",
      "depth": 1
    },
    {
      "id": "m4b47a9",
      "author": "Lifeofcrazyfrog",
      "body": "These 3 because of cluster of setup in India in cities that I have connections with. My family is in textile business and few close contacts in diamond biz. My goal is to do B2B first for all these ventures; for textile while I scale FBA to get some feedback loop in the biz. Think of smaller sellers themselves and etsy stores those will be the end customers. \n\nFor countertop, you have a great idea to go to builders. My friend who is in this Biz is exactly doing this.",
      "created_utc": 1735447349.0,
      "score": 6,
      "parent_id": "t1_m4b27a5",
      "depth": 1
    },
    {
      "id": "m4b4a40",
      "author": "Lifeofcrazyfrog",
      "body": "🤣 I know",
      "created_utc": 1735447383.0,
      "score": 4,
      "parent_id": "t1_m4b3uyg",
      "depth": 1
    },
    {
      "id": "m4b381q",
      "author": "Lifeofcrazyfrog",
      "body": "I have been looking at biz buy sell this whole year. Talked to 2 brokers. Have reviewed 20 businesses but didn’t find anything that was worthwhile. Once I narrow these 3 industries- I am certainly looking to buy a countertop install shop if I am going in that business..",
      "created_utc": 1735446919.0,
      "score": 7,
      "parent_id": "t1_m4b1vbq",
      "depth": 1
    },
    {
      "id": "m4bnhyc",
      "author": "GoldenPresidio",
      "body": "You should definitely be able to generate $450k with less of an enterprise value. Multiples are low for small companies",
      "created_utc": 1735457241.0,
      "score": 5,
      "parent_id": "t1_m4b1vbq",
      "depth": 1
    },
    {
      "id": "m4b3q5c",
      "author": "[deleted]",
      "body": "[deleted]",
      "created_utc": 1735447139.0,
      "score": 2,
      "parent_id": "t1_m4b1vbq",
      "depth": 1
    },
    {
      "id": "m4bbl41",
      "author": "Lifeofcrazyfrog",
      "body": "I hear you! That 9-5 makes me sad and miserable. I will regret not taking the leap and betting on myself. If it fails, getting a job back that pays 300k+ wouldn’t be too hard for me.",
      "created_utc": 1735450769.0,
      "score": 7,
      "parent_id": "t1_m4bajhj",
      "depth": 1
    },
    {
      "id": "m4b7y8g",
      "author": "Lifeofcrazyfrog",
      "body": "I wanna spend some time next month in India to narrow down the industry. Thanks for echoing it loud on your feedback. Love it and will sit with it to reflect what’s that one thing.",
      "created_utc": 1735449045.0,
      "score": 4,
      "parent_id": "t1_m4b76se",
      "depth": 1
    },
    {
      "id": "m4b28st",
      "author": "Lifeofcrazyfrog",
      "body": "That is so encouraging.  My childhood friend in India is doing $25M in revenue and wants to create a brand In US and have asked for my help. So, will explore that for sure. I have a manufacturer that I can trust and who is in biz for a while. Is your mom in d2c or b2b?",
      "created_utc": 1735446495.0,
      "score": 6,
      "parent_id": "t1_m4b0q5g",
      "depth": 1
    },
    {
      "id": "m4b0icm",
      "author": "Lifeofcrazyfrog",
      "body": "Totally. Think about that every day. Gotta test the waters, I can get a job with my resume in no time if push comes to shove. I am in my mid 30s, spent 14 years working for someone else. Maybe it will workout, maybe it won’t. But I will bear the fruits of mowing my own lawn :)",
      "created_utc": 1735445755.0,
      "score": 4,
      "parent_id": "t1_m4azlo2",
      "depth": 1
    },
    {
      "id": "m4b2toh",
      "author": "Lifeofcrazyfrog",
      "body": "It took me a lot of reflection to come to that. I am gonna give myself 2 years otherwise I can always go to my tech job with big brand names.",
      "created_utc": 1735446742.0,
      "score": 3,
      "parent_id": "t1_m4b1m98",
      "depth": 1
    },
    {
      "id": "m4dv8wi",
      "author": "dev_nilesh",
      "body": "What kind of business are you doing can explain a bit? How much investment did you spend at the initial stage",
      "created_utc": 1735494663.0,
      "score": 3,
      "parent_id": "t1_m4cajhu",
      "depth": 1
    },
    {
      "id": "m4bc4i4",
      "author": "Lifeofcrazyfrog",
      "body": "Appreciate your honest feedback. At the same time, My lil sister started her biz 7 years ago in India with no knowledge whatsoever. She works 3 hours a day on a busy day and makes what a Google engineer makes in India. I have been guiding her all along.",
      "created_utc": 1735451035.0,
      "score": 3,
      "parent_id": "t1_m4bam7f",
      "depth": 1
    },
    {
      "id": "m4bccts",
      "author": "Lifeofcrazyfrog",
      "body": "My family lives in Surat currently. I will reach out to connect with you when I am there.",
      "created_utc": 1735451148.0,
      "score": 3,
      "parent_id": "t1_m4bbsy2",
      "depth": 1
    }
  ],
  "fetched_at": 1755100785,
  "schema": "v1"
}