{
  "post": {
    "id": "1ixrzmh",
    "subreddit": "SaaS",
    "title": "Please stop. People hate talking to AI.",
    "author": "hotdoogs",
    "created_utc": 1740479514.0,
    "score": 236,
    "num_comments": 102,
    "url": "https://www.reddit.com/r/SaaS/comments/1ixrzmh/please_stop_people_hate_talking_to_ai/",
    "permalink": "https://www.reddit.com/r/SaaS/comments/1ixrzmh/please_stop_people_hate_talking_to_ai/",
    "selftext": "I see that eveybody is trying to automate and AI everything. From a business perspective it seems like a good idea, but from a consumer's perspective it's an absolute f\\*cking nightmare.\n\ni don’t want ai-generated spam flooding my inbox and linkedin messages with fake personalization\n\ni don’t want to talk to an ai chatbot when i need to reschedule my flight\n\ni don’t want to receive ai-generated phone calls pretending to be human\n\ni don’t want ai avatars flooding my social media feeds with soulless, generic \"influencer\" content\n\ni don’t want ai responding to my customer support emails with copy-paste answers when i need real help\n\ni don’t want ai answering my call at a restaurant when i’m trying to make a reservation\n\ni don’t want ai deciding who gets hired based on \"optimized\" but biased algorithms\n\nI also don't want ai agents to run my fucking business. \n\nSeriously. solve problems that actually need solving instead of just AI-ing everything."
  },
  "comments": [
    {
      "id": "meoibsf",
      "author": "Kindly_Manager7556",
      "body": "The problem is people think AI is a replacement when it's just an augment.",
      "created_utc": 1740479753.0,
      "score": 71,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meoq6hi",
      "author": "compelMsy",
      "body": "I think in the upcoming era of  AI everywhere, value of human interaction might increase and may even serve as differentiator for a company for providing services and support.",
      "created_utc": 1740484063.0,
      "score": 24,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meojden",
      "author": "s0l037",
      "body": "Spot on. The absolute carnage when you want to talk to a human when you have customer service problem is a fking nightmare and there are no humans available, faced this recently when my mailbox on wordpress domain got deleted, and all i got was AI generated crap, like do this, try this, blah blah. The AI folks have made simple things miserable.",
      "created_utc": 1740480372.0,
      "score": 16,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meol28z",
      "author": "CompliantPix",
      "body": "I heard about someone who had a devasting personal experience. Their HR department sent them an empathetic message, masterfully crafted with ChatGPT. 🤌",
      "created_utc": 1740481344.0,
      "score": 11,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meoug0e",
      "author": "jf-marino",
      "body": "As with everything there's nuance. I agree that if you have a problem with something (i.e. flight booking, a faulty product, etc.) you want to talk to an actual human being, so companies that try to push for AI in these areas will probably suffer from bad CX. However, I think it works really well when you're just browsing or asking exploratory questions. And it makes sense that you'd want to use AI here because these probably make a good  portion of what a customer support rep does in a day, and is mostly regurgitating the same stuff every time, so you free them up to talk to customer with actual problems.\n\nThe problem is companies/founders thinking that AI is going to completely replace human contact for them. They should be thinking the opposite. Replace the background processes and focus more time on talking to your customers.",
      "created_utc": 1740486070.0,
      "score": 5,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meox7dh",
      "author": "cajmorgans",
      "body": "It's getting kind of ridiculous looking at f.e ProductHunt and 9/10 applications are AI-related. AI-search engine, AI voice generator, AI todo list, AI calendars. Personally, looking through the launch archive, I find maybe 1-2% of the applications actually useful, and I can't understand if anyone actually pays for the rest.",
      "created_utc": 1740487255.0,
      "score": 6,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "mer1q8r",
      "author": "Small_Force_6496",
      "body": "AI is a tool not a product, I wish more could read this post.  When done right the user shouldn’t really even know an AI  is there, it should handle annoying repetitive tasks and aid with long tedious tasks",
      "created_utc": 1740510760.0,
      "score": 5,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meppkw4",
      "author": "boxxa",
      "body": "People forget you can't just drop in AI as a chatbot which people hate. It needs to be embedded into a smooth experience.\n\nIt is kind of funny, for a career in voice apps and natural language understanding, I still hate interacting with automated voice systems.",
      "created_utc": 1740497035.0,
      "score": 3,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meoyxal",
      "author": "AHardCockToSuck",
      "body": "There is too much money on the table for people to care what you like",
      "created_utc": 1740487957.0,
      "score": 3,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "merb36l",
      "author": "HeadLingonberry7881",
      "body": "Finally, thank you!",
      "created_utc": 1740513383.0,
      "score": 3,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "mesozqu",
      "author": "QuantumSuperbank",
      "body": "Absolutely agree. Tons of these things are such low quality that it probably even reduces efficiency rather than improving it.",
      "created_utc": 1740528038.0,
      "score": 3,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "metb77t",
      "author": "psyduckpikachu",
      "body": "Talking to an AI is one of the most frustrating experiences",
      "created_utc": 1740535311.0,
      "score": 3,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meoj4ef",
      "author": "Patient-Swordfish335",
      "body": "It's just another tool and can be used well or poorly. \n\nI recently had an experience that really sold me on AI in the right places. I was investigating a technical SAAS product and their home page had a chat box. I started asking questions and it came back with some really solid answers. I started to dig further into technical details and it's answers were phenomenally good, what I'd expect from a conversation with a real developer.\n\nLater in the day I returned to ask another question and this time took a little longer to type out my question. Before I could hit submit I saw a message saying that Jim had joined the chat. When I then hit submit the response was as you'd expect from a non-technical member of support - they had to get back to me... At that moment I longed to be chatting to the AI bot again.",
      "created_utc": 1740480226.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meoui1q",
      "author": "borntocooknow",
      "body": "I fully agree with you. These ai generated cold dm I receive on my LinkedIn inbox go straight to the bin. ",
      "created_utc": 1740486095.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meppqa1",
      "author": "[deleted]",
      "body": "[deleted]",
      "created_utc": 1740497080.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meqaija",
      "author": "CaptainDivano",
      "body": "We will stop using AI to answer via chat, when you will fucking start using knowledge-bases, articles and search functions, instead of jumping straight into the chat asking for questions clearly answered in the FAQS a gazillion times, and actually use your brain for 2 seconds.\n\n  \n\\-Sincerely, an eComm owner",
      "created_utc": 1740503102.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meqeeyc",
      "author": "Safety-Pristine",
      "body": "I do want a well made ai bot that can resolve my requests in seconds while OP sits in line for the next available operator listening to choppy jazz music",
      "created_utc": 1740504210.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meqkpq9",
      "author": "_cofo_",
      "body": "AI is just another tool to work with. It's a trend, so it will share the same fate as other trends. One day, nobody will give a sh!t if something has AI.",
      "created_utc": 1740505987.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "mesorme",
      "author": "everandeverfor",
      "body": "The problem is that it can \"talk\", but LLMs, don't take action.",
      "created_utc": 1740527965.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meu5omj",
      "author": "illathon",
      "body": "People hate talking to powerless AI.",
      "created_utc": 1740546518.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meugc6w",
      "author": "Lower-Instance-4372",
      "body": "Feels like we're automating the soul out of everything, just because we *can* AI something doesn’t mean we *should.*",
      "created_utc": 1740551667.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meuijcv",
      "author": "eightysixmonkeys",
      "body": "Every ceos wet dream. Automate everything, cut labor costs.",
      "created_utc": 1740552852.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meuinzc",
      "author": "eightysixmonkeys",
      "body": "Like half the posts on this sub are plug and play AI apps. So ironic",
      "created_utc": 1740552922.0,
      "score": 2,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meombco",
      "author": "Fixmyn26issue",
      "body": "I agree that clicking buttons is still more convenient for many applications. I also believe that it's a matter of habit, we are not used to give commands using natural language. If we were, we could achieve much more in less time with LLMs.",
      "created_utc": 1740482043.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meopy2b",
      "author": "UnusualClimberBear",
      "body": "Train you own agent to deal will all theses bad bots",
      "created_utc": 1740483944.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meos4r9",
      "author": "Born-Salamander-9265",
      "body": "True, there’s a bunch of problems that previously couldn’t be solved without AI but some people like to reinvent the wheel",
      "created_utc": 1740485011.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "mep26jb",
      "author": "N0C0d3r",
      "body": "I totally get it... The issue is that companies today don’t use AI for the right purposes... instead, they force it into places where human touch actually matters. Can people just use AI to automate the right things and not everything?",
      "created_utc": 1740489226.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "mep2uau",
      "author": "floriandotorg",
      "body": "That’s only true, because most implementations are bad. I was recently talking to an intercom bot and it was able to solve my admittedly complex problem in one answer.",
      "created_utc": 1740489476.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "mep8ig8",
      "author": "evogile",
      "body": "I think this is just the beginning, generating with AI is getting ridiculously simple nowadays, even my grandma chats with chatGPT over cake recipes.",
      "created_utc": 1740491448.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "mepd08v",
      "author": "Antique_Phrase9580",
      "body": "Bad implementation leads to bad results",
      "created_utc": 1740493013.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meptpcp",
      "author": "TheRepo90",
      "body": "can i be your friend?",
      "created_utc": 1740498256.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "mepz9yl",
      "author": "booleanderthal",
      "body": "Tell them to stop paying for AI solutions! As long as there's money to be made no one is stopping.",
      "created_utc": 1740499886.0,
      "score": 1,
      "parent_id": "t3_1ixrzmh",
      "depth": 0
    },
    {
      "id": "meqdoc4",
      "author": "Special_Trick5248",
      "body": "Half these people don’t even actually want to run a business or solve a problem and they need to admit that to themselves.",
      "created_utc": 1740504000.0,
      "score": 5,
      "parent_id": "t1_meoibsf",
      "depth": 1
    },
    {
      "id": "metsnoq",
      "author": "zemega",
      "body": "Yeah, augment is good. If there's AI in customer service, I want it to collect all the necessary information from me. Ask what my problem is, what's the case number, what's the etc. So that when the real customer service got to me, they have all the information to solve my problem. And they'll just go, Oh you only need to do this and this, give me some new information that needs to be entered into the system, things like that.",
      "created_utc": 1740541299.0,
      "score": 2,
      "parent_id": "t1_meoibsf",
      "depth": 1
    },
    {
      "id": "meorcz7",
      "author": "fredkzk",
      "body": "Exactly. These companies will win in the end for providing a better service.",
      "created_utc": 1740484642.0,
      "score": 8,
      "parent_id": "t1_meoq6hi",
      "depth": 1
    },
    {
      "id": "meqlna0",
      "author": "russtafarri",
      "body": "Yes, yes, 100% it will, and a whole new vertical will be born (or rather re-born).",
      "created_utc": 1740506247.0,
      "score": 2,
      "parent_id": "t1_meoq6hi",
      "depth": 1
    },
    {
      "id": "metv2cg",
      "author": "Jealous-Lychee6243",
      "body": "depends on vertical/product and customer type. i generally agree for B2B, B2C however at least when it comes to customer service I would way rather talk to a 24/7 AI bot than have to wait X hours to be connected over a busy line, call back tomorrow, etc../deal with all the other BS with over-the-phone customer service.",
      "created_utc": 1740542196.0,
      "score": 2,
      "parent_id": "t1_meoq6hi",
      "depth": 1
    },
    {
      "id": "meoqng8",
      "author": "[deleted]",
      "body": "As if things weren't miserable before. You got some underpaid person in Bangladesh who had no idea how to help you, and could barely speak English. No offense intended to those people, I'm sure they were doing their best. But the AI is no worse, and at least it can be understood.",
      "created_utc": 1740484298.0,
      "score": 10,
      "parent_id": "t1_meojden",
      "depth": 1
    },
    {
      "id": "meotnp0",
      "author": "farmyohoho",
      "body": "I understand your frustration. I think it could be solved with a triage system though. The support team in the company I work for resolves 30% of tickets on the first reply. You should see the kind of dumb questions people ask. For those cases AI takes care of it and frees up time for people with actual problems that need support agents. Lowering time to first response drastically. So the benefits of Ai chatbots are there. \nI just think it's still in the infancy phase. In a few more years we won't have those problems anymore.",
      "created_utc": 1740485716.0,
      "score": 5,
      "parent_id": "t1_meojden",
      "depth": 1
    },
    {
      "id": "meoqsu6",
      "author": "[deleted]",
      "body": "HR has been staffed by inhuman droids for decades.",
      "created_utc": 1740484372.0,
      "score": 16,
      "parent_id": "t1_meol28z",
      "depth": 1
    },
    {
      "id": "mep1m1d",
      "author": "fooz42",
      "body": "Let’s be real. The AI loves humanity more than humans do.",
      "created_utc": 1740489007.0,
      "score": 11,
      "parent_id": "t1_meol28z",
      "depth": 1
    },
    {
      "id": "meoolgq",
      "author": "ElegaBobcat",
      "body": "I suspect the apathy has been going on for decades, long before ChatGPT. Especially at bigger companies.",
      "created_utc": 1740483257.0,
      "score": 7,
      "parent_id": "t1_meol28z",
      "depth": 1
    },
    {
      "id": "mepty9y",
      "author": "operatorrrr",
      "body": "I was dating a chick who replied with some obvious gpt in a message 😩\n\nIt's def part laziness and part ineptitude",
      "created_utc": 1740498328.0,
      "score": 3,
      "parent_id": "t1_meol28z",
      "depth": 1
    },
    {
      "id": "meqms5l",
      "author": "russtafarri",
      "body": "Your final point is crucial. Data sovereignty. Or at least data-locus knowledge. Where is my data going, who has access to it and what will be done with it. Just as some traction in this domain is made, a whole new layer of obfuscation appears making it even harder to know where your augmented inquiry is stored and what's being done with it.",
      "created_utc": 1740506567.0,
      "score": 2,
      "parent_id": "t1_meppqa1",
      "depth": 1
    }
  ],
  "fetched_at": 1755100745,
  "schema": "v1"
}