{
  "post": {
    "id": "1juwefe",
    "subreddit": "SideProject",
    "title": "🚀 Built a Facebook Marketplace Listing Automation Software. Saves time &amp; Ad Money, Increases Facebook Engagements and Sales",
    "author": "Sensitive_Ocelot7964",
    "created_utc": 1744169297.0,
    "score": 7,
    "num_comments": 29,
    "url": "https://www.reddit.com/r/SideProject/comments/1juwefe/built_a_facebook_marketplace_listing_automation/",
    "permalink": "https://www.reddit.com/r/SideProject/comments/1juwefe/built_a_facebook_marketplace_listing_automation/",
    "selftext": "Let me share how I ended up building an automation tool for Facebook Marketplace Listing.\n\nBack in July 2024, I started selling random stuff around the house on Facebook Marketplace. First sale? A basketball I didn’t really use. Took good pics, wrote a nice title, posted it—and waited. Got a couple of messages. Meh.\n\nAbout a week later, Facebook said my listing had expired and needed to be renewed. While renewing, I got the option to share to groups. I picked 15 suggested groups.\n\nBoom. That same evening, 10 messages. 4 serious buyers. I was hooked.\n\nThat’s when I realized—**Facebook Marketplace + the right group strategy = 🔥**\n\nSoon I was selling more: a carpet, an old phone, a cooker. All within a week. Later, I worked with a phone company that funded Facebook Ads. While ads got tons of engagement, **actual sales came from my Marketplace + Group efforts**.\n\nBut here’s the pain point...\n\nOnce you're trying to list more than 5–10 items daily, doing this manually is draining. Especially with sharing to multiple groups. That’s why I started building **Fbyebot**.\n\n**💡 What is Fbyebot?**\n\nA simple automation tool that helps Facebook sellers post faster and smarter.\n\n# ✅ Features:\n\n* Auto-login to your FB account  \n* Auto-post listings (title, description, price, images)  \n* Batch upload products  \n* Post to multiple FB accounts  \n* Share listings to groups you're in  \n\n# 🧠 Why Use It?\n\n* Save 5–10+ hours/week  \n* Avoid human error  \n* Post more listings, faster  \n* Boost engagement + reach  \n* Increase your chances of making sales  \n\n**🎯 Who’s it for?**\n\n* Facebook resellers  \n* Dropshippers  \n* Small businesses scaling on FB  \n* Anyone tired of posting manually every day  \n\n\n\n# 🔍 Now I need your help\n\nI’ve tested it with phones and cars so far. Curious—what *else* could this tool help sell better?\n\nIf you're selling on Facebook, through Ads, Marketplace, or Groups, give **Fbyebot** a shot and let me know what you think. I’m open to feedback—what to tweak, improve, or remove.\n\n# 🧑‍💻 Devs:\n\nHappy to share the source code if you want to play around with it.\n\n# 💌 Want to try it out?\n\nShoot me a DM or email me at [yegonk247@gmail.com](mailto:yegonk247@gmail.com)  and I’ll send it over."
  },
  "comments": [
    {
      "id": "mmnkctv",
      "author": "Thorman77",
      "body": "Wow!! Was just looking through some stuff and stumbled upon your post. Getting ready to start a business using FB Marketplace. Most of the things out there I've seen are mostly for Dropshipping only and we are going to be doing something a little different. So, for sure curious how your program works. Are you a full developer as well or is this something you kind of spun up? Thanks and looking forward to hearing from you.",
      "created_utc": 1744416584.0,
      "score": 2,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "mnk0nq0",
      "author": "hardwayboyz",
      "body": "I sent a dm and I emailed you, looking forward to hear from you 💪",
      "created_utc": 1744881539.0,
      "score": 2,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "mqmhjlo",
      "author": "vc13vc13",
      "body": "This sounds amazing. Just sent you a DM and an email.",
      "created_utc": 1746403294.0,
      "score": 2,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "mtbxadm",
      "author": "moonbeamgirl5578",
      "body": "Congrats. I will give it a try. I just tried SellRaze and it was an awful experience",
      "created_utc": 1747762576.0,
      "score": 2,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "mtbxg38",
      "author": "moonbeamgirl5578",
      "body": "It is not in the App Store. Is it android only?",
      "created_utc": 1747762621.0,
      "score": 2,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "muas9p3",
      "author": "scottbonnar",
      "body": "I’ve Dm’d you",
      "created_utc": 1748239592.0,
      "score": 2,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "mwd9zaa",
      "author": "Youainthank",
      "body": "Sent an email. Looking forward to giving it a test!",
      "created_utc": 1749237548.0,
      "score": 2,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "mwqa5xc",
      "author": "MillieGirl92",
      "body": "I send you a email!!",
      "created_utc": 1749420210.0,
      "score": 2,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "myfg6hw",
      "author": "andrew_chmr",
      "body": "Interested!",
      "created_utc": 1750245270.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "mzchjoq",
      "author": "blondz97",
      "body": "Hey! I’m interested! Sent you an email and a DM",
      "created_utc": 1750693445.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "n0gwn3d",
      "author": "Some_Vermicelli_4597",
      "body": "Can I get copy",
      "created_utc": 1751230628.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "n0ios5d",
      "author": "Optimal_Turnip_9880",
      "body": "Interested",
      "created_utc": 1751254097.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "n1whgqi",
      "author": "Longjumping_Ad6449",
      "body": "Hello, i sent and email i am interested",
      "created_utc": 1751934799.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "n2wmpli",
      "author": "trengod3577",
      "body": "Just emailed you would def like to check this out.\nAnyone gotten it and have any feedback yet? Is there a git repo yet?",
      "created_utc": 1752418163.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "n5q1vxa",
      "author": "Financial-Law7854",
      "body": "Cara, parabéns demais pelo projeto! Dá pra ver que teve muito empenho e dedicação pra montar esse sistema de automação pro Marketplace.  \n\nAchei sensacional a ideia e como você conseguiu colocar tudo pra rodar.\n\nSe rolar de compartilhar o código ou mostrar um pouco mais de como fez, seria incrível!  \n\n\n\n\nTo super curioso pra entender melhor como você estruturou tudo.\n\n\n\n\nJá pensei em fazer no OLX, alguns anos atrás peguei um código com um Indiano ele usava iMacros e rodava liso.\n\n\n\n\nOlx é uma mina de ouro para vender.",
      "created_utc": 1753755584.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "n7kcdc3",
      "author": "TranscendingDX",
      "body": "Hi there!   \n  \nI was just researching to do something kind of like this, then found this thread, and it actually sounds pretty interesting, but what about something more specific?  \n  \nI mean, what if I need to post different types of items to sell which need very specific groups to be posted to, with more granularity, for example, there's \"PC only\" groups, but then there are \"GPU's only\" or \"Peripherals/accesories only\" or even \"Apple only\" etc.  \nAnd having a tool to be able to \"categorize\" precisely all those groups and just select the \"folder\" or collection previosly configured by the user to just post every item in all of those carefully selected groups all at once!\n\nI'm researching for this because that's actually, exactly what I'm experiencing now:   \nA LOT of frustration haha!  \n  \nBecause of having to select each group from an endless and messy list of groups I'm currently part of and it's been really time/energy consuming, cause I have to read every word to avoid any mistake and sometimes that's not even possible 'cause you cannot read the whole group's name!  \n  \nI don't really need any other kind of functionality, not even the \"multiple FB accounts\" It's just that right now I have A LOT of stuff to sell (because I'm moving out of here soon and simultaneously, I'm transitioning to a more \"minimalist\" type of living life as well)\n\nSo... would your tool work for this?\n\nThat would be tremendously helpful!!   \nIf that's the case, I would be eager to test your tool and of course, happily collaborate with all the feedback you need!",
      "created_utc": 1754640244.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "n86wsxc",
      "author": "shytec",
      "body": "Great that is what iam looking for. How can i get in contact with you? [Loe.Peace.Beats](http://Loe.Peace.Beats) from AMsterdam.",
      "created_utc": 1754951845.0,
      "score": 1,
      "parent_id": "t3_1juwefe",
      "depth": 0
    },
    {
      "id": "mmoppb0",
      "author": "Sensitive_Ocelot7964",
      "body": "Hi @Thorman77, first of all,  congratulations on your upcoming Business launch  and wishing you all the best. Secondly, I am grateful that you took the time to go through my post about my Facebook Marketplace Automation Software...glad you want to learn more about it. And yes, I like to think that it's because of my unique position of being in sales and marketing with a background in software development that enabled me to come up with this product.So, in a nutshell what this FB Marketplace Software does is, after you create a folder with your products and product description, which you will only do once. From there, all you will need is click on the software and it will automatically log in to your FB, go to FB marketplace, and start posting each of your products, then also share the listed products to more and more groups. All you will have to do from there is wait for messages and enquiries about your product and respond to them. If your business will be needing Facebook Marketplace, then I can Bet 💯  that this software will definitely boost your business, increase your engagement, Sales and save you so much time. If you are open to it, I could give you a demo of how the software works and the results it produces. Then if you like what you will see, we can set it up for your Business too. Thanks and looking forward to hearing from you. Just DMed you.",
      "created_utc": 1744433717.0,
      "score": 1,
      "parent_id": "t1_mmnkctv",
      "depth": 1
    },
    {
      "id": "mnorrtw",
      "author": "Sensitive_Ocelot7964",
      "body": "Got your DM @hardwayboyz, thanks for your interest in trying out this Facebook Listing Automation Tool",
      "created_utc": 1744939307.0,
      "score": 1,
      "parent_id": "t1_mnk0nq0",
      "depth": 1
    },
    {
      "id": "mqo3yut",
      "author": "Sensitive_Ocelot7964",
      "body": "Hi @Vc13vc13, I have reached back to you.Thanks for your interest.",
      "created_utc": 1746429037.0,
      "score": 1,
      "parent_id": "t1_mqmhjlo",
      "depth": 1
    },
    {
      "id": "mtcoeks",
      "author": "Sensitive_Ocelot7964",
      "body": "Hi, sorry to hear about your SellRaze experience... let's give it a try and see how you like it",
      "created_utc": 1747770500.0,
      "score": 1,
      "parent_id": "t1_mtbxadm",
      "depth": 1
    },
    {
      "id": "mu0zvbm",
      "author": "Sensitive_Ocelot7964",
      "body": "Currently on PCs windows, Mac and Linux",
      "created_utc": 1748102530.0,
      "score": 1,
      "parent_id": "t1_mtbxg38",
      "depth": 1
    },
    {
      "id": "mub16hu",
      "author": "Sensitive_Ocelot7964",
      "body": "Okay, let me send you the software",
      "created_utc": 1748244608.0,
      "score": 1,
      "parent_id": "t1_muas9p3",
      "depth": 1
    },
    {
      "id": "mwseust",
      "author": "Sensitive_Ocelot7964",
      "body": "Hi, I have emailed you back with the software.... thanks",
      "created_utc": 1749451020.0,
      "score": 1,
      "parent_id": "t1_mwqa5xc",
      "depth": 1
    },
    {
      "id": "myfrr61",
      "author": "Sensitive_Ocelot7964",
      "body": "Glad you would like to give this software a try\n\nLet me DM you or even better you can hit me through yegonk247@gmail.(om",
      "created_utc": 1750249908.0,
      "score": 1,
      "parent_id": "t1_myfg6hw",
      "depth": 1
    }
  ],
  "fetched_at": 1755100749,
  "schema": "v1"
}