{
  "post": {
    "id": "1klws9l",
    "subreddit": "Business_Ideas",
    "title": "Will you help me sell AI  workflow automation in the UK?",
    "author": "Low_Fix_7303",
    "created_utc": 1747168823.0,
    "score": 4,
    "num_comments": 15,
    "url": "https://www.reddit.com/r/Business_Ideas/comments/1klws9l/will_you_help_me_sell_ai_workflow_automation_in/",
    "permalink": "https://www.reddit.com/r/Business_Ideas/comments/1klws9l/will_you_help_me_sell_ai_workflow_automation_in/",
    "selftext": "Hi all,\n\nI run a well-established, one-man tech company that’s been operating for over 6 years, officially registered in the UK. My background is in software development and systems automation. Recently, I’ve expanded into AI-powered automation workflows - helping small to medium-sized blue collar businesses (like cleaning agencies, plumbers, electricians, and hairdressers) improve how they handle communication with customers.\n\nThese businesses are often out on the job all day, missing 10+ calls daily - lost revenue. I've built AI agents that handle incoming calls, WhatsApp messages, emails, and customer follow-ups. Despite not being a natural salesperson, I’ve already onboarded several paying clients in my local area through cold calling, and the interest has been unexpectedly high.\n\nWhat I’m Looking For:\n\nI'm now looking for a partner based in the UK who can sell and upsell these solutions to similar businesses. Ideally, you:\n\n    Are comfortable making 20–30 cold calls a day\n\n    Can identify and approach potential clients\n\n    Are tech-savvy enough to understand and discuss automated workflows with confidence\n\n    Have a strong interest in working with small businesses and solving real-world problems\n\nKey Details:\n\n    Business registration: UK\n\n    Location requirement: UK-based only, as understanding local SMEs and having the ability to communicate in the same time zone is crucial\n\n    Physical presence: The business is currently online-only; no physical office\n\n    Proposed arrangement: Flexible – open to working as commission-based contractor initially, with potential to grow into a more formal partnership or director role\n\n    Capital investment: No upfront investment required at this stage\n\n    Currency: GBP (£)\n\n    What I bring: A scalable tech platform, automation expertise, working products, existing clients, and strong backend infrastructure\n\n    What I need from you: Sales drive, outreach skills, and the ability to communicate tech benefits in simple terms\n\n    Partner input: Yes, you’d have the ability to shape direction, provide feedback, and co-develop the sales approach and offering\n\n    Financials: I have early-stage financial records and simple projections. Happy to share with serious partners\n\nIf this sounds like your kind of opportunity, drop me a message. Let’s chat and see if we can build something great together."
  },
  "comments": [
    {
      "id": "ms70ftp",
      "author": "DoStuffWu",
      "body": "I run a marketing agency for contractors in the US. I don’t fit this, but try reaching out to your network. Pick a definite niche, make a risk free offer, and track your outreaches and you should be good.",
      "created_utc": 1747185367.0,
      "score": 2,
      "parent_id": "t3_1klws9l",
      "depth": 0
    },
    {
      "id": "ms8vpxy",
      "author": "Personal_Body6789",
      "body": "The fact that your company has been running for six years already suggests a solid foundation. Expanding into AI automation for those sectors in the UK sounds like a logical next step.",
      "created_utc": 1747218454.0,
      "score": 2,
      "parent_id": "t3_1klws9l",
      "depth": 0
    },
    {
      "id": "msat3yb",
      "author": "Low_Fix_7303",
      "body": "quick update: Did cold-calling to 7 local businesses today and managed to sign another client! Another seems keen and wanted a quote. I'm definitely not a sales person, so I think  for someone who could increase the volume of cold calls to 20-30 per day, and has more sales skills than me, this can really be a great business!",
      "created_utc": 1747241996.0,
      "score": 2,
      "parent_id": "t3_1klws9l",
      "depth": 0
    },
    {
      "id": "ms95p1n",
      "author": "ExcuseOk57",
      "body": "Interested in learning morr can you send me a dm I can't cause new account 👍",
      "created_utc": 1747223141.0,
      "score": 1,
      "parent_id": "t3_1klws9l",
      "depth": 0
    },
    {
      "id": "msl9a01",
      "author": "Asleep-Ad9011",
      "body": "I’m interested",
      "created_utc": 1747382244.0,
      "score": 1,
      "parent_id": "t3_1klws9l",
      "depth": 0
    },
    {
      "id": "mtys0wl",
      "author": "Drypm",
      "body": "Hey can i ask you how you handle incoming calls? Are you using conversational AI?",
      "created_utc": 1748065893.0,
      "score": 1,
      "parent_id": "t3_1klws9l",
      "depth": 0
    },
    {
      "id": "muko35e",
      "author": "Due-Honey6248",
      "body": "Hey mate, \nI think i can help you! This is a new account, would you be able to dm me, please? \nBest",
      "created_utc": 1748375517.0,
      "score": 1,
      "parent_id": "t3_1klws9l",
      "depth": 0
    },
    {
      "id": "mxyxaht",
      "author": "Sea_Pudding4204",
      "body": "Hi mate, this sounds like something I can add value to. I’m interested, please send a DM to discuss this further.",
      "created_utc": 1750020291.0,
      "score": 1,
      "parent_id": "t3_1klws9l",
      "depth": 0
    },
    {
      "id": "ms91r94",
      "author": "Low_Fix_7303",
      "body": "Thanks, yes I’m currently doing that. About 1/4 seems genuinely interested and of these about half sign up. So the interest is there! But I need someone who is better at selling and who can do more calls. I’m too busy with the tech stack",
      "created_utc": 1747221412.0,
      "score": 1,
      "parent_id": "t1_ms70ftp",
      "depth": 1
    },
    {
      "id": "ms91uuw",
      "author": "Low_Fix_7303",
      "body": "That’s what I thought too!",
      "created_utc": 1747221457.0,
      "score": 1,
      "parent_id": "t1_ms8vpxy",
      "depth": 1
    },
    {
      "id": "ms9zfge",
      "author": "Low_Fix_7303",
      "body": "Will do!",
      "created_utc": 1747233437.0,
      "score": 1,
      "parent_id": "t1_ms95p1n",
      "depth": 1
    },
    {
      "id": "mslj6f6",
      "author": "Low_Fix_7303",
      "body": "Great! Please DM me with some details of your background",
      "created_utc": 1747388460.0,
      "score": 1,
      "parent_id": "t1_msl9a01",
      "depth": 1
    },
    {
      "id": "mtyuy71",
      "author": "Drypm",
      "body": "Can i ask you some questions in dm?",
      "created_utc": 1748067579.0,
      "score": 1,
      "parent_id": "t1_mtys0wl",
      "depth": 1
    }
  ],
  "fetched_at": 1755100799,
  "schema": "v1"
}