{
  "post": {
    "id": "1lhgni4",
    "subreddit": "Entrepreneur",
    "title": "How AI automation helped a realtor double his sales. What challenges do you face with automation?",
    "author": "leothewolf122",
    "created_utc": 1750571425.0,
    "score": 0,
    "num_comments": 7,
    "url": "https://www.reddit.com/r/Entrepreneur/comments/1lhgni4/how_ai_automation_helped_a_realtor_double_his/",
    "permalink": "https://www.reddit.com/r/Entrepreneur/comments/1lhgni4/how_ai_automation_helped_a_realtor_double_his/",
    "selftext": "I have been thinking about how AI and automation can save time in small businesses. For example, a realtor I know automated how he shortlisted homes for clients which freed up hours every week and helped him focus more on closing deals. His sales doubled as a result.\n\nWhat kind of repetitive or time-consuming tasks do you face in your business? Have you tried any AI or automation tools? I am curious to hear what works or doesn’t work for others."
  },
  "comments": [
    {
      "id": "mz3yg6v",
      "author": "AutoModerator",
      "body": "Welcome to /r/Entrepreneur and thank you for the post, /u/leothewolf122! Please make sure you read our [community rules](https://www.reddit.com/r/Entrepreneur/about/rules/) before participating here. As a quick refresher:  \n\n* Promotion of products and services is not allowed here. This includes dropping URLs, asking users to DM you, check your profile, job-seeking, and investor-seeking. *Unsanctioned promotion of any kind will lead to a permanent ban for all of your accounts.* \n* AI and GPT-generated posts and comments are unprofessional, and will be treated as spam, including a permanent ban for that account.   \n* If you have free offerings, please comment in our weekly Thursday stickied thread.\n* If you need feedback, please comment in our weekly Friday stickied thread. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Entrepreneur) if you have any questions or concerns.*",
      "created_utc": 1750571428.0,
      "score": 1,
      "parent_id": "t3_1lhgni4",
      "depth": 0
    },
    {
      "id": "mz49oj5",
      "author": "Important-Royal-520",
      "body": "I think you joined my newsletter right?\n\nI am sharing daily the same stuff you are talking about \n\nlike whatsapp ai agent for barber shops so they don't get bordered with \"how much?\" \"are you free later\"   \nsame for beauty saloons, airbnb host and co.\n\n  \ncheck it out if you want just google \"felix the ai money tree\"",
      "created_utc": 1750577749.0,
      "score": 1,
      "parent_id": "t3_1lhgni4",
      "depth": 0
    },
    {
      "id": "mz4akjd",
      "author": "YM_216",
      "body": "I wanna explore in this more, I have been seeing the hype behind AI automation and all that. Wanted to know if its worth trying out and seeing if they want it?",
      "created_utc": 1750578286.0,
      "score": 1,
      "parent_id": "t3_1lhgni4",
      "depth": 0
    },
    {
      "id": "mz6a8xg",
      "author": "Young_Denver",
      "body": "This is fake, and written by someone who has no idea how a realtor business works",
      "created_utc": 1750609092.0,
      "score": 1,
      "parent_id": "t3_1lhgni4",
      "depth": 0
    },
    {
      "id": "mz50n9n",
      "author": "leothewolf122",
      "body": "It is worth it if you actually make a tool which solve a problem. Not some fancy chatbot to talk with, but if that chatbot does something, you are making something.",
      "created_utc": 1750593173.0,
      "score": 2,
      "parent_id": "t1_mz4akjd",
      "depth": 1
    },
    {
      "id": "mz6thws",
      "author": "leothewolf122",
      "body": "Well it happened...",
      "created_utc": 1750614825.0,
      "score": 0,
      "parent_id": "t1_mz6a8xg",
      "depth": 1
    }
  ],
  "fetched_at": 1755100757,
  "schema": "v1"
}