{
  "post": {
    "id": "1loc3ar",
    "subreddit": "Business_Ideas",
    "title": "Struggling to land clients... should I keep pushing my AI assistant service or pivot?",
    "author": "DIabolicalPvP",
    "created_utc": 1751301024.0,
    "score": 2,
    "num_comments": 30,
    "url": "https://www.reddit.com/r/Business_Ideas/comments/1loc3ar/struggling_to_land_clients_should_i_keep_pushing/",
    "permalink": "https://www.reddit.com/r/Business_Ideas/comments/1loc3ar/struggling_to_land_clients_should_i_keep_pushing/",
    "selftext": "Hey folks,\n\nI spent about three weeks making 700 cold calls and got nothing. Then, in a separate job interview, I described the platform I use, and the interviewer was super interested in my highest package on the spot. That told me the product has real value, but my usual pitch isn’t connecting.\n\n**What the platform does, all inside one login:**\n\n* Picks up calls, texts, emails, Facebook and Instagram messages, even Google Business Chat, and keeps every thread in one inbox\n* Books jobs, sends reminders, triggers follow-ups, and moves deals along a drag-and-drop pipeline\n* Spins up websites, funnels, blogs, stores, webinars, and membership portals without extra plugins\n* Sends invoices, runs subscriptions, and takes card payments through Stripe, PayPal, Square, or Authorize\n* Manages crew calendars, pushes “tech on the way” texts, and stores signed contracts and photos\n* Fires off review requests, answers Google reviews with AI suggestions, and shows the stars on the client’s site\n* Live dashboards show lead sources, revenue, ad spend, call answer rate, and review score\n* Unlimited users, role-based permissions, two-factor login, daily backups, plus an API if we need to push data anywhere else\n\n**Where I’m stuck:**\n\n* Cold calls alone feel like rolling a rock uphill. Should I switch to email sequences, short demo videos, ads, or mix them?\n* I’m guessing high-ticket, low-recurrence niches like restoration, roofing, specialty cleaning, or legal, but I’m open to better ideas.\n* I'm not sure when to bring on commission representatives. Close a few more deals first or recruit early so I’m not the only seller?\n* Need a 30-second pitch that highlights the benefits without listing every feature.\n\nIf you’ve sold automation tools or SaaS to local service businesses, what’s working for you? Outreach methods, niche picks, quick-win demos, anything. I’d appreciate the advice."
  },
  "comments": [
    {
      "id": "n0mdavc",
      "author": "Thin_Rip8995",
      "body": "you don’t need to pivot you need to package\n\nyour pitch is swiss army knife overload. nobody buys features they buy pain relief. stop listing tools, start naming headaches it kills\n\n\"we answer your leads instantly, book jobs while your competitors are still asleep, and get you paid faster with zero follow-up\"  \nthat’s your new 30 sec pitch  \nthen show 60 seconds of it in action, no voiceover just raw speed. one pain point, one screen, one result\n\nditch cold calls for loom videos + niche-specific landing pages. make 5 versions for different industries and A/B the hell out of them. top 3 verticals to target: home services, legal, and med spas—high LTV, slow tech adoption, no patience for admin\n\ncommission reps? not yet. close 3-5 solo first so you know the process before you outsource it. otherwise they’ll just burn leads\n\n**The** [**NoFluffWisdom Newsletter**](https://NoFluffWisdom.com/Subscribe) has some ruthless takes on niche targeting, pitching fast, and building sales engines that vibe with this worth a peek!",
      "created_utc": 1751307878.0,
      "score": 5,
      "parent_id": "t3_1loc3ar",
      "depth": 0
    },
    {
      "id": "n0oqo32",
      "author": "Try_Harder7",
      "body": "Your service sounds expensive. Give away an upgradable entry product.",
      "created_utc": 1751334918.0,
      "score": 3,
      "parent_id": "t3_1loc3ar",
      "depth": 0
    },
    {
      "id": "n0rtw67",
      "author": "Iforgotmypwrd",
      "body": "Can you find a partner who can do the marketing/sales for you? Or build an affiliate program so anyone can sell the product and get paid a % for that. \nYou can probably find someone to help you set that up on upwork",
      "created_utc": 1751383334.0,
      "score": 2,
      "parent_id": "t3_1loc3ar",
      "depth": 0
    },
    {
      "id": "n0rx5h2",
      "author": "Alternative-Drop-907",
      "body": "I work as a fractional CMO for B2B saas. I work with companies doing $1 - $5 million in revenue that have hit a friction typically in their growth. A lot of it is what was working is no longer which makes them feel like they are at day one again. It's really frustrating for the business owner.\n\nI said all that to show how clear my message is to a specific audience. \n\n**Need is not enough — not by a long shot.**\n\nWhen I do outreach, even cold calls, I don’t spray and pray. I *strategically* target businesses in my niche that I know I can help — and more importantly, that are *eager* to be helped.\n\nHere’s the thing:  \n**You don’t sell fire extinguishers to people who don’t believe the kitchen’s on fire.**\n\nThey might need it.  \nThey might even *admit* the smoke.  \nBut if they’re not *ready* to act — if they don’t *want* to solve the problem — your pitch won’t land.\n\nNeed is common.  \n**Desire is the driver.**\n\nYour job isn’t to convince the uninterested.  \nIt’s to connect with the people already sweating from the smoke, searching for a solution, and ready to grab the hose.\n\nRight now, you are trying to be too many things at once. Everything that your SAAS can do is great but that is not what sells. And a sales team won't help at this stage.\n\n**My recommendation:** Start by uncovering *who* — the group feeling the biggest pain. You’re going to tackle this step by step.\n\nPick just **2 to 3 industries** and make your early conversations exploratory. Whether they buy or not, aim to gather **valuable feedback.** Every call or meeting is data.\n\nUse that feedback to benchmark traction:\n\n* Are you noticing a **pattern**? (\"Everyone keeps mentioning X…\") That’s your cue to refine your offer.\n* Are you seeing an **uptick**? (\"I’m getting a deal every X number of outreaches…\") That’s your signal to double down.\n\nOnce you uncover *your one*, **hone in hard**. Go all in. Don’t dilute your focus chasing shiny options.\n\nThe biggest trap for ambitious entrepreneurs today isn’t lack of ideas — it’s lack of focus. Everything feels like an opportunity, but it’s the **one thing** you stick with, test, and tune that will carry you across the finish line.\n\nHope that helps and good luck!",
      "created_utc": 1751384220.0,
      "score": 2,
      "parent_id": "t3_1loc3ar",
      "depth": 0
    },
    {
      "id": "n0lvxnh",
      "author": "AcanthisittaNo6174",
      "body": "Share your website and link interested",
      "created_utc": 1751303080.0,
      "score": 1,
      "parent_id": "t3_1loc3ar",
      "depth": 0
    },
    {
      "id": "n0m6jux",
      "author": "Environmental_Two581",
      "body": "Would like to see a\nDemo",
      "created_utc": 1751305971.0,
      "score": 1,
      "parent_id": "t3_1loc3ar",
      "depth": 0
    },
    {
      "id": "n0mzgjz",
      "author": "[deleted]",
      "body": "[removed]",
      "created_utc": 1751314364.0,
      "score": 1,
      "parent_id": "t3_1loc3ar",
      "depth": 0
    },
    {
      "id": "n0o7v1z",
      "author": "aladinznut",
      "body": "Can you build AI chat agents?",
      "created_utc": 1751328269.0,
      "score": 1,
      "parent_id": "t3_1loc3ar",
      "depth": 0
    },
    {
      "id": "n0mhg6k",
      "author": "DIabolicalPvP",
      "body": "\"loom videos + niche-specific landing pages. make 5 versions for different industries and A/B the hell out of them. top 3 verticals to target: home services, legal, and med spas—high LTV, slow tech adoption, no patience for admin\"\n\nCan you explain that, I am really confused about what they all means but otherwise I am really interested. Thank you!!!",
      "created_utc": 1751309092.0,
      "score": 1,
      "parent_id": "t1_n0mdavc",
      "depth": 1
    },
    {
      "id": "n0n7ql6",
      "author": "vultuk",
      "body": "This.\n\nI looked at the list of things it can do and went \"why would I need that\". If I can't think of a reason to hit you up, then you need to tell me why I should.",
      "created_utc": 1751316772.0,
      "score": 1,
      "parent_id": "t1_n0mdavc",
      "depth": 1
    },
    {
      "id": "n0t98cv",
      "author": "DIabolicalPvP",
      "body": "This is something I might look into, trying to figure out how to give it out for free without them having to dive fully in.",
      "created_utc": 1751397562.0,
      "score": 1,
      "parent_id": "t1_n0oqo32",
      "depth": 1
    },
    {
      "id": "n0t9be0",
      "author": "DIabolicalPvP",
      "body": "Thats what I was thinking, bringing on commission based only reps to help me get sales and stuff.",
      "created_utc": 1751397586.0,
      "score": 1,
      "parent_id": "t1_n0rtw67",
      "depth": 1
    },
    {
      "id": "n0t9j5x",
      "author": "DIabolicalPvP",
      "body": "thank you!!! this helps a lot!!!",
      "created_utc": 1751397648.0,
      "score": 1,
      "parent_id": "t1_n0rx5h2",
      "depth": 1
    },
    {
      "id": "n0lznpo",
      "author": "DIabolicalPvP",
      "body": "I currently do not have my own website since I am pretty new to it and wasn't sure if it was even worth it.",
      "created_utc": 1751304096.0,
      "score": 1,
      "parent_id": "t1_n0lvxnh",
      "depth": 1
    },
    {
      "id": "n0mh9vm",
      "author": "DIabolicalPvP",
      "body": "I could totally do that for you if you are interested. DM me!",
      "created_utc": 1751309040.0,
      "score": 1,
      "parent_id": "t1_n0m6jux",
      "depth": 1
    },
    {
      "id": "n0ohins",
      "author": "DIabolicalPvP",
      "body": "Yes I can which i do a lot of.",
      "created_utc": 1751331692.0,
      "score": 1,
      "parent_id": "t1_n0o7v1z",
      "depth": 1
    }
  ],
  "fetched_at": 1755100815,
  "schema": "v1"
}